{
  "about_commit": "Committing the project saves changes to JSON files, and stores the project, including your code, to a tar.gz file.",
  "aboutcode.1": "This package will be imported into the framework, and as pages are requested these functions will be called, and their actions will determine the page returned.  Your Python package is located at:",
  "aboutcode.2": "This location is normally symlinked to your own project directory:\r\n\r\n...projectdirectory/projectcode\r\n\r\nWhich is the location you would normally edit. Under this directory you should have an __init__.py file containing definitions of functions:\r\n\r\nstart_project - Called once when the project is first loaded from the JSON file.\r\n\r\nstart_call  - called when the server receives a call.\r\n\r\nsubmit_data - called by Responders, may be called multiple times within a call.\r\n\r\nend_call    - called prior to returning the page.\r\n\r\nThese functions are available for you to develop and can in turn call on any further modules you wish to include within the package - hence you can access your own databases and functionality.  The arguments to these functions, and their expected return values are described below:",
  "aboutcode.3": "As well as the projectcode directory, your own project directory contains a subdirectory:\r\n\r\n....projectdirectory/projectfiles\r\n\r\nThis is also symlinked into the framework. Any files you wish to attach to the project, such as images or static files should be within this, under the directory:\r\n\r\n....projectdirectory/projectfiles/static\r\n\r\nwhich within the framework, appears as:",
  "aboutcode.end": "You should define the function:\r\n\r\nend_call(page_ident, page_type, call_data, page_data, proj_data, lang)\r\n\r\nThis function is called at the end of a call prior to filling the template (or other type of returned page) with data, and gives you the opportunity to set any further fields in page_data, and to optionally set a session cookie string.\r\n\r\npage_ident is the ident of the page being returned. A tuple ('projname', pagenumber), this is usually the ident of the template, css etc., page but can also be the ident of one of the responders which create a dynamic page (see page_type).\r\n\r\npage_type is a string giving the type of the page returned, typically 'TemplatePage', 'CSS', 'SVG', 'FilePage' or 'JSON'. Certain responders create their own pages and for these the page_type will be the responder type, one of 'SubmitJSON', 'SubmitPlainText', 'SubmitCSS', 'SubmitIterator'.\r\n\r\ncall_data is the dictionary first created by start_call, and possibly modified during the call by responders and your submit_data function.\r\n\r\npage_data is the dictionary populated with widgfield keys and values to go in the widget fields. It could have been populated by your start_call and submit_data functions, and can be further modified here.\r\n\r\nproj_data is the dictionary initially returned by start_project. Typically it is either unused or its contents can be set to any project wide data you require.\r\n\r\nlang is the tuple (language, default_language) provided by start_call.\r\n\r\nThis function should return either None, or optionally a session cookie string. This string will be returned with the next call to this web site in the recieved_cookies dictionary with key being the project name.\r\n\r\nDo not raise a GoTo exception here. Unlike the 'submit_data' function, the results of this function are passed directly to the page given by page_ident.\r\n\r\nIf a FailPage exception is raised, the error will be shown on the page given by page_ident.",
  "aboutcode.failpage": "This exception can be imported into your __init__.py file using:\r\n\r\nfrom .. import FailPage\r\n\r\nIt has arguments:\r\nFailPage(message = '', section='', widget='')\r\n\r\nFailPage is an Exception class that, being raised, makes the Responder call its failure page with an error message.\r\nIt takes arguments - message together with section and widget which indicate where the message is to be displayed.\r\n\r\nTheir default values are empty strings, leave as empty if you do not wish to pass any information.\r\nHowever if possible:\r\n\r\nmessage - An error message string. If missing, the display widget's default 'show_error' text will be shown.\r\n\r\nsection - If the display widget is in a section this should be the section alias, if it is not, leave as an empty string.\r\n\r\nwidget - The name of the widget in the failure page where this message will be displayed.  How the message is displayed will depend on the widget. If not given the message will be shown in the pages default error widget.",
  "aboutcode.goto": "This exception can be imported into your __init__.py file using:\r\n\r\nfrom .. import GoTo\r\n\r\nIt has arguments:\r\nGoTo(target, clear_submitted=False, clear_page_data=False)\r\n\r\nThis is an Exception class that, being raised, forces a jump to the page given by the target argument.\r\n\r\nGoTo has arguments:\r\n\r\ntarget: is the ident, label or external url of the page to jump to. If a url is given it should start with 'http://' or 'https://' or '//'\r\n\r\nclear_submitted: if True, any submitted data in the widget fields will be discarded. This allows a GoTo to an AllowedFields responder that expects nothing to be submitted.\r\n\r\nclear_page_data: if True the page_data dictionary will be cleared.\r\n\r\nIf the target ident is that of a responder page then it cannot be a responder already visited within the call (this will raise a ServerError) as this may cause an infinite loop condition.",
  "aboutcode.intro": "Within __init__.py you should define the functions:\r\n\r\n start_project(project, projectfiles, path, option)\r\n\r\n start_call(environ, path, project, called_ident, caller_ident, received_cookies, root_session_string, ident_data, lang, option, proj_data)\r\n\r\n submit_data(caller_ident, ident_list, submit_list, submit_dict, call_data, page_data, lang)\r\n\r\n end_call(page_ident, page_type, call_data, page_data, proj_data, lang)\r\n\r\nYour __init__.py module should also import four exceptions which you can use in your functions. These exceptions are available from the parent package, so you can import them using:\r\n\r\nfrom .. import FailPage, GoTo, ValidateError, ServerError",
  "aboutcode.servererror": "This exception can be imported into your __init__.py file using:\r\n\r\nfrom .. import ServerError\r\n\r\nIt has arguments:\r\nServerError(message = '', section='', widget='')\r\n\r\nServerError has the same arguments as FailPage. It will return the special server error page with status 500.\r\n\r\nNormally leave section and widget empty to allow the message to be displayed in the page default error widget.",
  "aboutcode.skilift.editfolder.folderchange": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.editfolder import folderchange\r\n\r\nfolderchange(project, foldernumber)\r\n\r\nGiven a project name, and the integer ident number of a folder within the project, it returns a 'change' uuid associated  with the folder. A new random uuid is generated every time a folder is changed, and is therefore a measure that a given folder both exists, and has not changed since the last time it was accessed.\r\n\r\nThe project must be currently loaded as either the root project or a sub-project. \r\n\r\nReturns None if no folder with this foldernumber is found.",
  "aboutcode.skilift.editfolder.rename_folder": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.editfolder import rename_folder\r\n\r\nrename_folder(project, foldernumber, newname)\r\n\r\nGiven a project name, the integer ident number of a folder within the project, and a new folder name, it changes the folder name and returns None on success, or an error message on failure\r\n\r\nThe project must be currently loaded as either the root project or a sub-project.",
  "aboutcode.skilift.editpage.pagechange": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.editpage import pagechange\r\n\r\npagechange(project, pagenumber)\r\n\r\nGiven a project name, and the integer ident number of a page within the project, it returns a 'change' uuid associated  with the page. A new random uuid is generated every time a page is changed, and is therefore a measure that a given page both exists, and has not changed since the last time it was accessed.\r\n\r\nThe project must be currently loaded as either the root project or a sub-project. \r\n\r\nReturns None if no page with this pagenumber is found.",
  "aboutcode.skilift.editpage.rename_page": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.editpage import rename_page\r\n\r\nrename_page(project, pagenumber, newname)\r\n\r\nGiven a project name, the integer ident number of a page within the project, and a new page name, it changes the page name and returns None on success, or an error message on failure\r\n\r\nThe project must be currently loaded as either the root project or a sub-project.",
  "aboutcode.skilift.editsection.sectionchange": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.editsection import sectionchange\r\n\r\nsectionchange(project, section_name)\r\n\r\nGiven a project name, and an existing section name within the project, it returns a 'change' uuid associated  with the section. A new random uuid is generated every time a section is edited, and is therefore a measure that a given section both exists, and has not changed since the last time it was accessed.\r\n\r\nThe project must be currently loaded as either the root project or a sub-project.\r\n\r\nReturns None if no section with this name is found.",
  "aboutcode.skilift.folder_info": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift import folder_info\r\n\r\nfolder_info(project, foldernumber)\r\n\r\nThe project must exist as either the root, or a sub project of the root, foldernumber is the ident number of a folder.\r\n\r\nThe function raises a ServerError, if no folder is found, otherwise returns a namedtuple with contents:\r\n'name', 'number', 'restricted', 'brief', 'contains_pages', 'contains_folders'.\r\n\r\nThe values are:\r\n'name' holds the folder name.\r\n'number' is the folder number from the argument.\r\n'restricted' is True if access is restricted (cannot be called by URL), False otherwise.\r\n'brief' holds the brief description of the folder.\r\n'contains_pages' - True if the folder contains pages, False otherwise.\r\n'contains_folders' - True if the folder contains pages, False otherwise.",
  "aboutcode.skilift.folders": "This is a generator which can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift import folders\r\n\r\nfolders(project, foldernumber)\r\n\r\nThe project must exist as either the root, or a sub project of the root, foldernumber is the ident number of a folder.\r\n\r\nThe generator raises a ServerError if no folder is found, otherwise the generator yields a namedtuple describing each sub folder within the folder over each iterated pass.\r\n\r\nThe named tuple has contents:\r\n'name', 'number', 'restricted', 'brief', 'contains_pages', 'contains_folders'.\r\n\r\nThe values are:\r\n'name' holds the sub folder name.\r\n'number' is the sub folder number.\r\n'restricted' is True if access is restricted (cannot be called by URL), False otherwise.\r\n'brief' holds the brief description of the sub folder.\r\n'contains_pages' - True if the sub folder contains pages, False otherwise.\r\n'contains_folders' - True if the sub folder contains pages, False otherwise.",
  "aboutcode.skilift.fromjson.create_folder": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.fromjson import create_folder\r\n\r\ncreate_folder(project, parentnumber, addition_number, folder_name, restricted, json_data)\r\n\r\nGiven a project name, a parent folder number, an addition_number, a folder name, a True or False restricted value and a json string (or ordered dictionary) describing the folder and its contents, it creates a new folder and contents.\r\n\r\nThe folder name should not already exist in the parent folder.\r\n\r\nThe json string is typically derived from a previously saved JSON file, and each folder and page within it will already have an ident number.  The 'addition_number' argument of this function is added to each ident number, and should take the new ident numbers outside the range of existing numbers within the project.",
  "aboutcode.skilift.fromjson.create_page": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.fromjson import create_page\r\n\r\ncreate_page(project, parentnumber, pagenumber, page_name, page_brief, json_data)\r\n\r\nGiven a project name, a parent folder number, a new page number, a page name, a brief description and a json string (or ordered dictionary) describing the page, it creates a new page with the new page number. The number should not already exist in the project.",
  "aboutcode.skilift.fromjson.create_part": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.fromjson import create_part\r\n\r\ncreate_part(project, pagenumber, page_part, section_name, widget_name, container_number, location_list, part_type, json_data)\r\n\r\nBuilds the part and contents from the given json_data which is either a json string or ordered dictionary, and adds it to the project either inserted into the html element currently at the given part location, or if not an element that can accept contents, inserted after the element.\r\n\r\nThe project must be currently loaded as either the root project or a sub-project.\r\n\r\nNote, the arguments can be derived from the skilift function part_info and (apart from json_data) refer to the parent html element.  The json_data argument is that provided by either part_to_OD or part_to_json functions, typically previously saved to a JSON file.",
  "aboutcode.skilift.fromjson.create_section": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.fromjson import create_section\r\n\r\ncreate_section(project, section_name, json_data)\r\n\r\nGiven a project name, a section name and a json string (or ordered dictionary) describing the section, it creates a new section (or overwrites a section with the same name). The project must be currently loaded as either the root project or a sub-project.\r\n\r\nThe json_data string or Ordered Dictionary is typically taken from a JSON file created by any of the functions; section_to_OD, section_to_json, part_to_OD, part_to_json.",
  "aboutcode.skilift.fromjson.folder_to_OD": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.fromjson import folder_to_OD\r\n\r\nfolder_to_OD(project, foldernumber)\r\n\r\nGiven a project name, and a folder number, it returns an Ordered Dictionary defining the folder and its contents. The project must be currently loaded as either the root project or a sub-project, and the folder must exist in the project.",
  "aboutcode.skilift.fromjson.folder_to_json": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.fromjson import folder_to_json\r\n\r\nfolder_to_json(project, foldernumber, indent=0)\r\n\r\nGiven a project name, and a folder number it returns a json string defining the folder and its contents. The project must be currently loaded as either the root project or a sub-project, and the folder must exist in the project.\r\n\r\nThe indent parameter should be the number of indentation spaces to use when formatting the string.",
  "aboutcode.skilift.fromjson.get_defaults": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.fromjson import get_defaults\r\n\r\nget_defaults(project, key=None)\r\n\r\nIt reads the defaults.json file of the given project. If a key is given, it returns the value of that key, otherwise it returns the entire dictionary of the JSON file. If no value is found, returns None.",
  "aboutcode.skilift.fromjson.get_widget_default_field_value": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.fromjson import get_widget_default_field_value\r\n\r\nget_widget_default_field_value(project, widg_module, widg_class, widg_field)\r\n\r\nWhen a widget is created or edited, certain fields can be set with defaults - currently CSS classes and CSS Styles. You have the option to save these defaults for the widget field.\r\n\r\nThese defaults are held in the project 'defaults.json' file.\r\n\r\nThis function reads the defaults.json file and returns the default string value for the given widget and field. \r\n\r\nTo specify the widget and field, you need to supply the project name, and:\r\n\r\nwidg_module is the module name of the widget.\r\nwidg_class is the class name of the widget\r\nwidg_field is the field name of the widget\r\n\r\nIf the default value is not found, the function returns an empty string.",
  "aboutcode.skilift.fromjson.page_to_OD": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.fromjson import page_to_OD\r\n\r\npage_to_OD(project, pagenumber)\r\n\r\nGiven a project name, and a page number, it returns an Ordered Dictionary defining the page. The project must be currently loaded as either the root project or a sub-project, and the page must exist in the project.",
  "aboutcode.skilift.fromjson.page_to_json": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.fromjson import page_to_json\r\n\r\npage_to_json(project, pagenumber, indent=0)\r\n\r\nGiven a project name, and a page number, it returns a json string defining the page. The project must be currently loaded as either the root project or a sub-project, and the page must exist in the project.\r\n\r\nThe indent parameter should be the number of indentation spaces to use when formatting the string.",
  "aboutcode.skilift.fromjson.part_to_OD": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.fromjson import part_to_OD\r\n\r\npart_to_OD(project, pagenumber, page_part, section_name, widget_name, container_number, location_list, part_type)\r\n\r\nIt returns an Ordered Dictionary defining the part and its contents. The project must be currently loaded as either the root project or a sub-project, and the part must exist in the page. The function is valid for an html page element such as a div which can contain further elements or widgets. \r\n\r\nNote, the arguments can be derived from the skilift function part_info.",
  "aboutcode.skilift.fromjson.part_to_json": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.fromjson import part_to_json\r\n\r\npart_to_json(project, pagenumber, page_part, section_name, widget_name, container_number, location_list, part_type, indent=0)\r\n\r\nIt returns a json string defining the HTML element and its contents. The project must be currently loaded as either the root project or a sub-project, and the part must exist in the page.\r\n\r\nThe indent parameter should be the number of indentation spaces to use when formatting the string.\r\n\r\nThe function is valid for an html page element such as a div which can contain further elements or widgets. \r\n\r\nNote, the arguments can be derived from the skilift function part_info.",
  "aboutcode.skilift.fromjson.project_to_OD": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.fromjson import project_to_OD\r\n\r\nproject_to_OD(project)\r\n\r\nFor the given project the function returns an Ordered Dictionary, which could be large. The dictionary describes the project pages and widgets.",
  "aboutcode.skilift.fromjson.project_to_json": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.fromjson import project_to_json\r\n\r\nproject_to_json(project, save_to_file=True, indent=0)\r\n\r\nFor the given project:\r\n\r\nIf save_to_file is True, this function creates the file project.json under the projectfiles/project/data directory, and returns None.\r\n\r\nIf save_to_file is False, the function returns a json string, which could be large. This string describes the project pages and widgets.\r\n\r\nThe indent parameter should be the number of indentation spaces to use when formatting the string.",
  "aboutcode.skilift.fromjson.save_defaults": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.fromjson import save_defaults\r\n\r\nsave_defaults(project, defaults)\r\n\r\nGive a defaults dictionary, this function saves the entire dictionary as the defaults.json file for the project.",
  "aboutcode.skilift.fromjson.save_widget_default_field_value": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.fromjson import save_widget_default_field_value\r\n\r\nsave_widget_default_field_value(project, widg_module, widg_class, widg_field, value)\r\n\r\nThis function saves a default value string for a given widget field (currently CSS classes and CSS styles) in the project 'defaults.json' file.\r\n\r\nTo specify the widget and field, you need to supply the project name, and:\r\n\r\nwidg_module is the module name of the widget.\r\nwidg_class is the class name of the widget\r\nwidg_field is the field name of the widget\r\n\r\nThe function returns True if ok, False if not.",
  "aboutcode.skilift.fromjson.section_to_OD": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.fromjson import section_to_OD\r\n\r\nsection_to_OD(project, section_name)\r\n\r\nGiven a project name, and a section name, it returns an Ordered Dictionary defining the section. The project must be currently loaded as either the root project or a sub-project, and the section must exist in the project.",
  "aboutcode.skilift.fromjson.section_to_json": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.fromjson import section_to_json\r\n\r\nsection_to_json(project, section_name, indent=0)\r\n\r\nGiven a project name, and a section name, it returns a json string defining the section. The project must be currently loaded as either the root project or a sub-project, and the section must exist in the project.\r\n\r\nThe indent parameter should be the number of indentation spaces to use when formatting the string.",
  "aboutcode.skilift.fromjson.set_defaults": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.fromjson import set_defaults\r\n\r\nset_defaults(project, key, value)\r\n\r\nThis function sets a key:value pair into the defaults.json file for the project.",
  "aboutcode.skilift.get_root": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift import get_root\r\n\r\nget_root()\r\n\r\nThis function takes no arguments and returns the project name of the current root project.",
  "aboutcode.skilift.ident_exists": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift import ident_exists\r\n\r\nident_exists(project, itemnumber)\r\n\r\nReturn True if a page or folder with this itemnumber exists, False otherwise.",
  "aboutcode.skilift.item_info": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift import item_info\r\n\r\nitem_info(project, itemnumber)\r\n\r\nThe project must exist as either the root, or a sub project of the root, itemnumber is the ident number of a page or folder.\r\n\r\nThe function returns None, if no page or folder is found, otherwise returns a namedtuple with contents:\r\nproject, project_version, itemnumber, item_type, name, brief, path, label_list, change, parentfolder_number, restricted.\r\n\r\nThe values are:\r\n'project' - the project name from the argument.\r\n'project_version' is the project version string.\r\n'itemnumber' is the itemnumber from the argument.\r\nitem_type' - one of 'TemplatePage', 'Folder', 'JSON', 'CSS', 'RespondPage', 'FilePage', 'SVG'.\r\n'name' holds the page or folder name.\r\n'brief' holds the brief description of the item.\r\n'path' is the url path.\r\n'label_list' is a list of labels (as there could be more than one) pointing to this item.\r\n'change' is a uuid of the item, changed whenever the item is altered by this admin site.\r\n'parentfolder_number' is the integer number of the parentfolder or None if this is the root folder.\r\n'restricted' is True if access is restricted (cannot be called by URL), False otherwise.",
  "aboutcode.skilift.labels": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift import labels\r\n\r\nlabels(project=None)\r\n\r\nThis function returns a dictionary of labels to idents/url's.\r\n\r\nIf project is not given assumes the root project, if given, project must exist as either the root, or a sub project of the root.",
  "aboutcode.skilift.off_piste.append_scriptlink_in_pages": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.off_piste import append_scriptlink_in_pages\r\n\r\nappend_scriptlink_in_pages(project, label)\r\n\r\nFor every template page in the project, appends a script link to the head section pointing to the page with the given label. Generally used to set a link to a javascript file in all your pages.",
  "aboutcode.skilift.off_piste.insert_div_in_body": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.off_piste import insert_div_in_body\r\n\r\ninsert_div_in_body(project, css_class, brief)\r\n\r\nFor every template page in the project, inserts a div with the given css class attribute as the containing div in each page body (thus encapsulating all other body contents), unless a div with this class already exists at this point.\r\n\r\nSets the body div brief description with the brief given here.",
  "aboutcode.skilift.off_piste.set_backcol_in_pages": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.off_piste import set_backcol_in_pages\r\n\r\nset_backcol_in_pages(project, backcol)\r\n\r\nFor every template page in the project, which has the option to set a background colour enabled, this functions sets the background colour in the top &lt;html&gt; tag.\r\nThe backcol argument should be a colour string, such as \"#FF0000\".",
  "aboutcode.skilift.off_piste.set_bodyclass_in_pages": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.off_piste import set_bodyclass_in_pages\r\n\r\nset_bodyclass_in_pages(project, bodyclass)\r\n\r\nFor every template page in the project, sets the CSS class into the <body> tag.",
  "aboutcode.skilift.off_piste.set_widget_css_to_default": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.off_piste import set_widget_css_to_default\r\n\r\nset_widget_css_to_default(project)\r\n\r\nFor each template page in the project, set all widget CSS class fields to their default values, if a default has been set.\r\nNote: This does not change widgets in sections or svg pages.",
  "aboutcode.skilift.off_piste.set_widget_field_value": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift.off_piste import set_widget_field_value\r\n\r\nset_widget_field_value(project, widget_name, widget_field_name, new_value, new_brief=None)\r\n\r\nFor every template page in the project, if it contains a widget with the given widget name and field name, then set the field value, and widget brief.\r\n\r\nThe field can only be a single value field, not dictionary, table or list fields.\r\n\r\nIf no brief is given, or an empty string is given, then the brief is not changed.",
  "aboutcode.skilift.page_info": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift import page_info\r\n\r\npage_info(project, pagenumber)\r\n\r\nThe project must exist as either the root, or a sub project of the root, pagenumber is the ident number of a page.\r\n\r\nThe function raises a ServerError, if no page is found, otherwise returns a namedtuple with contents:\r\n'name', 'number', 'restricted', 'brief', 'item_type', 'responder'.\r\n\r\nThe values are:\r\n'name' holds the page name.\r\n'number' is the page number from the argument.\r\n'restricted' is True if access is restricted (cannot be called by URL), False otherwise.\r\n'brief' holds the brief description of the page.\r\n'item_type' - one of 'TemplatePage', 'JSON', 'CSS', 'RespondPage', 'FilePage', 'SVG'.\r\n'responder' - responder Class name, such as 'SubmitData' etc., or empty string if the page is not a responder.",
  "aboutcode.skilift.pages": "This is a generator which can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift import pages\r\n\r\npages(project, foldernumber)\r\n\r\nThe project must exist as either the root, or a sub project of the root, foldernumber is the ident number of a folder.\r\n\r\nThe generator raises a ServerError if no folder is found, otherwise the generator yields a namedtuple describing each page within the folder over each iterated pass.\r\n\r\nThe named tuple has contents:\r\n'name', 'number', 'restricted', 'brief', 'item_type', 'responder'.\r\n\r\nThe values are:\r\n'name' holds the page name.\r\n'number' is the ident page number.\r\n'restricted' is True if access is restricted (cannot be called by URL), False otherwise.\r\n'brief' holds the brief description of the page.\r\n'item_type' - one of 'TemplatePage', 'JSON', 'CSS', 'RespondPage', 'FilePage', 'SVG'.\r\n'responder' - responder Class name, such as 'SubmitData' etc., or empty string if the page is not a responder.",
  "aboutcode.skilift.part_info": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift import part_info\r\n\r\npart_info(project, pagenumber, section_name, location)\r\n\r\nThe project must exist as either the root, or a sub project of the root, pagenumber and section_name are mutually exclusive, one must be None.\r\n\r\nlocation is a tuple or list consisting of three items:\r\n  a string (such as head or section name or widget name)\r\n  a container integer, such as 0 for widget container 0, or None if not in container\r\n  a tuple or list of location integers\r\n\r\nReturns None if part not found, otherwise returns a namedtuple with items\r\nproject, pagenumber, page_part, section_name, widget_name, container_number, location_list, part_type.\r\n\r\npage_part is one of 'head', 'body', 'svg' or None if the part is in a section.",
  "aboutcode.skilift.projectURLpaths": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift import projectURLpaths\r\n\r\nprojectURLpaths()\r\n\r\nThis function takes no arguments and returns a dictionary of project names as keys with the URL paths as values. The projects being the root project and any sub-projects attached to it. Please note, if this project is being administered using 'skiadmin' - then the project 'skiadmin' will be visible in this dictionary, however when the project is running without skiadmin, this project will no longer be present.\r\n\r\nYou should expect to see the root project itself in the dictionary, and at least the 'lib' project which is normally attached as a sub-project.",
  "aboutcode.skilift.project_loaded": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift import project_loaded\r\n\r\nproject_loaded(project, error_if_not=True)\r\n\r\nReturns True if the project is the root or a sub project. If the given project is not one of these, either raises a ServerError exception (if error_if_not is True) or returns False.",
  "aboutcode.skilift.projfiles": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift import get_projectfiles_dir\r\n\r\nStatic files, and control files (such as the json files defining your project) are saved outside the python package structure under a 'projectfiles' directory.  This function can be used to obtain the directory where your project files are saved.\r\n\r\nget_projectfiles_dir(project=None)\r\n\r\nIf project is not given, returns the projectfiles directory path.\r\nIf project is given, returns the projectfiles/project directory path.",
  "aboutcode.skilift.textblocks": "This function can be imported into your __init__.py file using:\r\n\r\nfrom ...skilift import get_textblock_text\r\n\r\nget_textblock_text(textref, lang, project=None)\r\n\r\nThis function returns the textblock text, given a textblock reference string,\r\n\r\nlang is the language tuple  of (preferred language, default language). If text for a given language is not found, the function makes an effort to get text by trying the default language and english.\r\n\r\nIf project is not given assumes the root project, if given, project must exist as either the root, or a sub project of the root.\r\n\r\nIf no text is found, returns None.",
  "aboutcode.start": "You should define the function:\r\n\r\nstart_call(environ, path, project, called_ident, caller_ident, received_cookies, ident_data, lang, option, proj_data)\r\n\r\nWhen a call is initially received this function is called. Note the function will not be called when responders or template pages are subsequently accessed within a call.\r\n\r\nenviron is the wsgi environ value\r\n\r\npath is the URL path to the page called.\r\n\r\nproject is the project name.\r\n\r\ncalled_ident is normally the ident of the page being called, it is a tuple ('myprojname', pagenumber) - with 'myprojname' being the project name, and pagenumber being the unique integer page number.\r\n\r\nIf the path is not to a recognised page, the called_ident will be None.\r\n\r\ncaller_ident is the ident of the page making the call, a tuple ('projname', pagenumber), generally sent with any submitted data, this value could be an empty tuple if the page ident is not known - which will happen if the calling page is external or if no data is submitted.\r\n\r\nreceived_cookies is a dictionary of cookie name:values received from the client. Note, that if a language cookie is set by a LanguageCookie responder, the cookie value received will be set in the 'lang' tuple, and will also appear in this dictionary with key 'language'.\r\n\r\nident_data is a string which was previously saved onto the page making the call by setting page_data['ident_data'], and has now been sent back together with any submitted data.\r\nThis facility can therefore be used to pass a reference identifier between calls. You need to validate this string here as it can be altered by a malicious caller. ident_data will be None if not present.\r\n\r\nlang is a tuple of two strings containing the preferred language required by the client in the format (language, default_language). The first item 'language' is initially taken from the client browser's language setting, but will also be taken from the language cookie if one is set via a LanguageCookie responder.\r\n\r\noption is a project attribute, generally a string set on the command line with the -o option when the program was started - or it could be a value set programatically when the project is created by skipoles.load_project(). Typically it is unused, and by default is set to None.  But it could be used for your own purpose - for example to input a database password when the program is started.\r\n\r\nproj_data is the dictionary initially returned by start_project.\r\n    \r\nThis function should return the tuple:\r\n(called_ident, call_data, page_data, lang)\r\n\r\nIf any tests you set here, which could include testing session cookie values, are ok, then the returned called_ident should normally be the called_ident given in the argument which is that of the page being called.\r\n\r\nIf the called_ident returned is None, the 'URL NOT FOUND' page will be automatically returned.\r\n\r\nIf you wish to handle the call via another page, return an ident, label or url of a page to jump to, typically leading to a login page.\r\n\r\nIf the called_ident returned is that of a Responder page, then depending on the responder, (or sequence of responders) further function calls may be made to the submit_data function below. If called_ident is not a responder (for example a template page) then the function end_call will be called next.\r\n\r\ncall_data is a dictionary which can be either an empty dictionary, or could contain data to pass to the subsequent responders during this call.\r\n\r\npage_data is a dictionary to be populated by this or subsequent submit_data functions, or by the end_call function during the progress of this call.\r\nIt consists of a dictionary of {widgfields:values,...} which will be set in the final template page. If there is no need to set any such values here, then an empty dictionary should be returned.\r\n\r\nNote: a widgfield is a tuple ('widgetname', 'fieldname'), or a tuple ('sectionalias','widgetname', 'fieldname') if the widget is part of a section.\r\n\r\nThe lang tuple returned should normally be the same tuple given in the argument, but can be altered.\r\nIt will be used to request TextBlocks, and will also be passed to subsequent submit_data functions during the call.\r\n\r\nNo un-caught exception should be raised in this function - if any are, the Server error page will be displayed.",
  "aboutcode.startproj": "You should define the function:\r\n\r\nstart_project(project, projectfiles, path, option)\r\n\r\nThis function is called when the project is first loaded by skipoles.load_project().  If your web server starts multiple processes, then be aware this function will be called multiple times.\r\n\r\nproject is the project name.\r\n\r\nprojectfiles is the string path to the project's projectfiles/projectname directory.\r\n\r\npath is the url path to the project.\r\n\r\noption is a project attribute, generally a string set on the command line with the -o option when the program was started - or it could be a value set programatically when the project is created by skipoles.load_project(). Typically it is unused, and by default is set to None. But it could be used for your own purpose - for example to input a database password when the program is started.\r\n\r\nThe function should return a dictionary, which will be passed to subsequent functions as proj_data. Again there may be multiple copies, one created for each process. If this feature is not used, return an empty dictionary.",
  "aboutcode.submit": "You should define the function:\r\n\r\nsubmit_data(caller_ident, ident_list, submit_list, submit_dict, call_data, page_data, lang)\r\n\r\nThis function is called when a Responder wishes to submit data for processing in some manner. This function typically should populate the page_data dictionary, usually with widgfields as keys, and values to insert into the fields.\r\n\r\nA Responder is chosen from a list of Responders by yourself, and added to this site like any other page. Each Responder has a different functionality. Certain Responders call this submit_data function. Typically a client web browser would make a call to a Responder, which would validate the call, set data into the call_data dictionary, and then call the submit_data function.  Responders generally are set with a target ident - generally the ident of a template page, which will have its widgets populated by the page_data dictionary.\r\n\r\nThe Responder calling this function should specify what it wants returned in its documentation.\r\nMost Responders require 'None' to be returned, but, for example, the LogIn Responder requires a session string.\r\n\r\nNote: a widgfield is a tuple ('widgetname', 'fieldname'), or a tuple ('sectionalias', 'widgetname', 'fieldname') if the widget is part of a section.\r\n\r\ncaller_ident is the ident of the page making the call, a tuple ('projname', pagenumber), generally sent with any submitted data, this value could be an empty tuple if the page ident is not known - which will happen if the calling page is external or if no data is submitted.\r\n\r\nIt is possible for one Responder to pass the call to another, therefore this function could be called multiple times within a single call, ident_list is the list of such Responder idents called - the first item being the Responder ident called by the user, the last entry being the Responder ident that called this function.\r\nEach item in the list is a tuple of the form ('projname', pagenumber).\r\n\r\nsubmit_list is a list of strings which may be submitted by the Responder calling this function.\r\nThey are optionally used for your convenience, and set when you add a Responder to the project.\r\n\r\nsubmit_dict is a dictionary which may be submitted by the Responder calling this function.\r\nThe use depends on the Responder - read the Responder documentation.\r\n\r\ncall_data is the dictionary previously returned by start_call, it will be passed to subsequent Responders during a call.  Your functions can populate it in any way required, however if you wish to clear it, use call_data.clear() rather than deleting it.\r\nTypically a Responder would be used to pass submitted form data into this call_data dictionary prior to this function being called.\r\n\r\nSimilarly page_data is the second dictionary previously returned by start_call, it will also be passed to subsequent Responders during a call.  Your functions can populate it with keys which should be widgfields and values to go in the widget fields.  At the end of the call, these will be inserted into the template or JSON page. If you wish to clear this dictionary, use page_data.clear() rather than deleting it.\r\n\r\nlang is the tuple (language, default_language) provided by start_call.\r\n\r\nOn returning from this function the call will be passed to the Responder's target page, which could typically be a template page (in which case your end_call function will be called next) or it could be another Responder.  If required a GoTo exception could be raised to jump elsewhere, or a FailPage exception could be raised to jump to the Responders failure page with an error message.",
  "aboutcode.validateerror": "This exception can be imported into your __init__.py file using:\r\n\r\nfrom .. import ValidateError\r\n\r\nIt has arguments:\r\nValidateError(message = '', section='', widget='')\r\n\r\nValidateError has the same arguments as FailPage. It will return the special validate error page with status 400.\r\n\r\nNormally leave section and widget empty to allow the message to be displayed in the page default error widget.",
  "changes_not_saved": "Changes not saved",
  "editpage.page_name_required": "A page name is required",
  "editpart.attribute_table": "This table consists of attribute names and values, you can edit any name:value, and then press Change to set the changes, or Delete to remove the attribute.",
  "export_tar.site_app": "__main__.py consists of a simple python script that starts the python standard library web server and runs your application. Simply use:\r\n\r\npython3 __main__.py\r\n\r\nThis will serve your application on port 8000. ('python3' should invoke Python 3.2 or later.)\r\n\r\nThe default automatically generated __main__.py imports the skipoles package and calls the skipoles.load_project() function to create a wsgi application function which is then served with the python library web server.\r\n\r\nIf instead of the default you wished to create your own __main__.py, you should create a __main__.py and insert it beneath the 'data' folder as shown above. It will then replace the default when you commit the project.\r\n\r\nAs well as __main__.py, the file myapp.py is created. This is a minimal file, also calling skipoles.load_project() and defining the wsgi application function, but not running any server. Typically it is to be used with a third party wsgi server. For example using uwsgi:\r\n\r\nuwsgi --plugin python3,http --http :8000 --wsgi-file myapp.py\r\n\r\nBoth __main__.py and myapp.py should be inspected as they illustrate how the wsgi application can be used.",
  "folder_ident_not_known": "Folder ident not known",
  "index_background_colors": "A background color can be set into the <html> tag of your project pages. This helps to prevent a flash of white when the page is loading on a slow site. The background color can be set individually on each page - or if set here, can be applied across all pages that have the 'show background color in html tag' set.  In general, the color should be set to the same background color applied via CSS to your body element.",
  "index_bodyclass": "The CSS class in all Template page <body> tags can be set here.",
  "index_insert_css_link": "For each template page, insert a CSS link to the given label, in the page head, before the element with the given brief.",
  "index_set_css_class": "For each element within each template page body, if it has a given brief, set its CSS class attribute.",
  "index_sub_projects": "Each site can consist of a root project with a number of sub projects.\r\n\r\nThis project being edited is the 'root' project. You can add further sub projects if you have already created them. This should always include the 'lib' project which contains javascript files used by all other projects.\r\n\r\nYou will also see the 'skiadmin' sub-project, this is automatically added when the project is administered, and automatically removed from the tar file when the project is commited, so it is not included within your project.\r\n\r\nNote: Projects added here will not include any sub-projects they may have themselves - each sub project required must be added separately.",
  "index_test_colors": "The options below generate a colour palette from a background colour you choose.\r\n\r\nThe colour pallet produced will be applied to the w3-theme-ski.css used by this admin project - not to your own project. This feature is available to test combinations of colours which you may choose (or not) to use yourself. You may have to use CTRL-R to refresh your cache.\r\n\r\nThe resultant css file can be downloaded from:",
  "index_widget_classes": "When widget CSS class fields are set, it is possible to set the applied class to be the 'default' for this widget type and its field.\r\nThe option below allows you to set all template page widgets CSS classes in your project to be their appropriate default - so if you prefer a new default part way through building the project, you can apply it retrospectively.\r\nPlease note: this change is not applied to widgets in 'Sections'.",
  "managesections.about_sections": "Sections are blocks of html and widgets which are added to the project under a section name.\n\nThe section block should not be confused with the html section tag - generally this section block will consist of a div, together with any amount of content.",
  "managesections.add_top_widget": "To set a Widget into the section, choose a module from the table below, and then choose a widget from the module.  Some widgets may contain further html and further widgets. Once chosen and added to the section, you will be able to edit the contents in future by choosing to edit the section.",
  "managesections.more_about_sections": "Once a section is created, it can be added to multiple pages. Subsequent editing of the section here will then change it across all pages.",
  "managesections.new_section": "Create a new section by choosing a name, a div will be created which you will be able to edit - adding further html and widgets.",
  "managesections.section_table": "Or choose a section to edit:",
  "managespecialpages.about_libfiles": "The following labels point to file locations, either as file page idents if the files are held locally, or as URL's to external sites. These labels will be used to create links in page headers, whenever a new page is created.",
  "managespecialpages.about_pages": "Page \"Labels\" are strings associated with a page ident or an external URL.\r\nSome of these pages are used by this Skipole system, and are expected to exist, together with fixed name widgets and fields - for example the 'redirector' page must contain a Redirector widget with name 'redirect_to' and field 'url'.\r\nIn general, the system special pages should be treated with caution, and should not be altered.\r\nHowever, if you must: to edit - change the ident, and press Edit.",
  "managespecialpages.user_pages": "It is also possible to add your own labels and idents, which may be useful - in\r\nparticular you can create labels with external URL's, and set links using this label.\r\nShould the external URL change, then changing the URL here will change it throughout.\r\nDo not use labels starting with 'ski_' as future versions may introduce further\r\nspecial pages using this prefix to avoid clashing with your labels.",
  "no_javascript_text": "JAVASCRIPT FAILURE\r\n\r\nThis page is shown because the script on the previous page has failed to run.\r\n\r\nThis could be due to either a failure in the script, or your browser has javascript disabled.",
  "operations": "The operations defined here apply across multiple project pages.",
  "page.20001": "This is the top Admin page.\r\n\r\nTop navigation functions:\r\n\r\nThese change to folder edit links, so if working on a page you can quickly jump to its parent folder.\r\n\r\nMain functions of this page:\r\n\r\nThe Project Version records your own version numbering system, generally using a dotted version system such as 1.0.3. Apart from this value being saved with the project, it is not used by the skipole framework.\r\n\r\nA brief description of the project can be set, with the default language (a two or three letter designation such as 'en') and the path to the project - generally just '/'.\r\n\r\nYou can choose a page to edit (via a page ident number, label or path). This option is also available by the left navigation panel.\r\n\r\nCommit Project\r\n\r\nThis saves your changes to JSON files and also creates a 'tar.gz' file which you can download and store.  If you do not commit the project, any changes will be lost when the server is stopped.\r\n\r\nDownload\r\n\r\nOnce committed to the tar.gz file, this option allows you to download a copy for safe storage elsewhere. If a project is deleted from the skipole framework, but you have the tar file safely stored, then the --import option of skipole.py will import and rebuild the project from the tar.gz file.\r\n\r\nSub projects\r\n\r\nProjects previously created can be added as 'sub-projects', and accessed by a URL given here.\r\n\r\nCopy project\r\n\r\nA new project can be created by copying this edited project to a new name.\r\n\r\nLeft navigation functions :\r\n\r\nProject\r\n\r\nTakes you to the edited project home page.\r\n\r\nRoot Folder\r\n\r\nGoes straight to edit the top root folder of the project, a good place to start.\r\n\r\nPage Labels\r\n\r\nPages are generally referred to by their ident number, which is set when the page is first created.  However it is possible to set a 'label'  to the ident (essentially a label to number dictionary). Given such a label alias, a page can be referred to by the label.\r\n\r\nTextBlocks\r\n\r\nAllows TextBlocks to be created, these being a reference string, associated with a block of text.  The reference string can be set into a page, and the text will then be shown.\r\n\r\nSections\r\n\r\nAllows sections of HTML and widgets to be created, which can then be placed into pages, typically used to create page headers and footers common to multiple pages in the project.\r\n\r\nColours\r\n\r\nAllows the colours of these admin pages to be set, used to explore colour combinations.\r\n\r\nOperations\r\n\r\nSeveral special project wide operations are gathered together here.\r\n\r\nPython Code\r\n\r\nDescribes where your Python code should be located, what functions you should provide, and their arguments and return values.",
  "page.20129": "The URL of the sub-project can be set here - this does not change the project itself, it only sets the URL where the sub-project will appear under this root project.\r\n\r\nIn the situation of overlapping URL's:\r\n\r\nA sub-project URL has preference over a page URL set by the folders and pages within the root project.  So if the root project has a folder and page at:\r\n\r\n/myproj/myfolder/mypage\r\n\r\nAnd if a sub-project is added with URL /myproj/myfolder/, then the sub-project will always be contacted with URL's starting /myproj/myfolder/ and the mypage of the root project will never be served.\r\n\r\nIf two sub-projects have overlapping URL's, the project with the more specific (longest) URL set here will be served first.",
  "page.20300": "This page allows you to explore colours by generating a colour palette from a given background colour - and using this generated palette in these admin pages.\r\n\r\nThe palette generated attempts to pick a set of 'near' colours which hopefully will harmonise with the background colour, and also some contrasting colours for text.\r\n\r\nThese are then inserted into CSS classes within the file w3-theme-ski.css which can be downloaded from this page.\r\n\r\nYou are the free to use - or not as you wish - this resultant file and these colours in your own CSS pages.",
  "page.20409": "This page will be returned to the client as a JSON file.\r\n\r\nGenerally a JSON file should only be returned when a widget which explicitly requires a JSON file calls the server.  The file contents can be those widgfields on the calling page with values that are labeled as 'JSON settable'.\r\n\r\nTypically this is used to set specific widgfield values on the calling page without having to refresh the entire page.",
  "page.20500": "When you 'commit' the project, it will be saved to json files, and these, together with your static pages and Python code, and a copy of the skipole Python packages needed to run a site, will be saved into a tar.gz file.\r\n\r\nYou can take a copy of the tar.gz file and save it elsewhere to store a snapshot of the project. You can also extract the contents to create a python web site of your project without the admin functions.\r\n\r\nThe tar.gz file can also be later imported back into the skipole framework should the project be deleted.",
  "page.22009": "Edit a Folder\r\n\r\nYou can view a folder's contents, and edit, insert or delete folders or pages within it.\r\n\r\nIf the edited folder is not the project root folder you can set it as 'restricted', in which case the folder contents cannot be called directly by their URL.  These contents can only be called via a user function or by Responders forwarding calls to these pages.\r\n\r\nThe default page of a folder is the page returned if the calling URL is that of the folder.",
  "page.22109": "To create a folder, to which you can add pages and further folders, leave the 'Linked Server Path' unchecked and fill in folder name, description and ident number. You can either accept the next free ident number (which is automatically shown), or you can choose your own number.\r\n\r\n'Restricted Access' should be set if the folder contents cannot be called directly by URL, such a folder is generally used to hold template pages which are only accessed after a responder has been called.\r\n\r\nAt some point you may need to add 'File Pages' which link to static files on your server. However if you wish to add a number of File Pages - a javascript library for example - it becomes tedious to add them individually, so you can set 'Linked Server Path' here and File Pages will automatically be created to reflect the actual files beneath the given server directory (relative to 'projectfiles'). This is recursive - so sub folders and their contents will be created as well. \r\n\r\nHowever this linking is not dynamic, any future file additions or deletions on the server will require new File Pages to be created and added to the folder.\r\n\r\nAs well as creating a folder, you also have the alternative option here of importing a folder definition JSON file - which will include any of that folders contents, presuming you have previously created such a file (available as a Download option when you edit a folder). However as Folder and Page ident numbers will be imported, and may clash with your current ident numbers, you have the option here of setting a number which will be added to each of the imported idents. Choose a number to make the new idents outside of your current ident number range.\r\n\r\nYou should also set a new folder name, which will replace that set in the file, this name should be unique within the parent folder.",
  "page.22309": "A 'Template' page contains html elements and widgets.\r\n\r\nA 'Responder' page is a script, which generally acts on submitted data by calling validation functions, storing submitted data and calling your submit_data function.\r\n\r\nAn 'SVG Image' page is like a Template page, but holds SVG elements and widgets.\r\n\r\nA 'CSS' page holds CSS style declarations.\r\n\r\nA JSON page sends the contents of the dictionary 'page_data' as a JSON formatted file.\r\n\r\nA 'File Link' page links to a file held on the server, such as a pdf file or a static html file. When this page is requested by a client browser, the associated file is served.\r\n\r\nIt should be noted that the associated file is only saved and included in the export.tar file if it is sited beneath the folder projectfiles/projectname/static\r\n\r\nEvery folder and page has a unique ident number, with the root folder of the project having number zero. You can either accept the next free ident number (which is automatically shown), or if you wish to organise folders and pages by number you can choose your own numbering scheme.\r\n\r\nA brief description of the page should be provided.\r\n\r\nA new page name, unique in the folder, must be given.\r\n\r\nOnce a new page has been created and added to the folder, it will need to be edited to be given content.",
  "page.22431": "The SVG image created here is a dynamic container, with tags and widgets set in the same manner as a template page.\r\n\r\nHowever the tags and widgets added should only be those compatible with the SVG standards. It may be better, if the dynamic facilities provided here are not required, to serve a pre-made image as a static file.",
  "page.22451": "A 'File Link' page links to a file held on the server, such as a pdf file or a static html file.\r\n\r\nWhen this page is requested by a client browser, the associated file is served. It should be noted that the associated file is only saved and included in the export.tar file if it is sited beneath the folder projectfiles/projectname/static",
  "page.22461": "You can choose to either input the ident number of a page to be copied, or upload a page definition file (currently only available for 'template' and ''svg' pages).\r\n\r\nPage definition files can be downloaded from the 'edit' page area.\r\n\r\nOnce copied, the new page will have the new ident, name and folder, but otherwise will be a duplicate of the page copied.",
  "page.23209": "A Template page can be edited here.\r\n\r\nThe 'html' tag of the page can have two attributes set here, the 'lang' attribute, and the background colour.\r\n\r\nSetting the background colour in the html tag can be useful to stop a white page being briefly displayed on slowly loading sites before the associated CSS page is loaded. Check the textbox if you want to use this facility, or uncheck it if not, and press Submit. The RGB colour values (decimal 0-255) should normally be the same as the background colour you set in the body tag.\r\n\r\nThe page Default Error Widget is the widget name within the page which will display an error message, if an error exception is raised which does not specify a displaywidget.  If you wish to set a default error widget which is within a section, then set the name as sectionalias,widgetname.\r\n\r\nThe left navigation buttons 'Head' and 'Body' allow you to insert and edit items in the page head and body parts.",
  "page.23329": "Though it is possible to edit the 'head' of the page here, it should generally not be necessary.\r\n\r\nLinks to widget javascript modules are added automatically by the framework as you add widgets to your pages. So probably the only items you may wish to insert are links to your own javascript and CSS files.\r\n\r\nBefore doing so, please check the Page Labels administrative functions, where you have the option to set default CSS and Javascript links - which will be automatically inserted in the page head whenever a new page is created.",
  "page.23349": "You can insert and edit html tags, widgets, sections, text and TextBlocks into the 'body' of the page here.\r\n\r\n'insert' creates a new item within an element, 'append' adds a new item after\r\nan element, the arrow keys can be used to move items around.\r\n\r\nIn general, html tags and their attributes are static, in that they cannot be changed dynamically via your Python functions.\r\n\r\nWidgets however have a number of fields which can be changed by setting the page_data dictionary.\r\n\r\nThere are some exceptions to this:\r\n\r\nThe 'body' tag - the css class in the body tag can be set dynamically by setting page_data['body_class'] to the class value.\r\n\r\nSections can be set to be included if page_data[section_alias, 'show'] is True (the default) or excluded if set to False.\r\n\r\nHTML elements that have an attribute with a label surrounded by curly braces, such as {page_label} - this will be changed to the URL if page_label is a previously defined label.",
  "page.23409": "You can add and edit elements and widgets in this page by choosing the 'SVG' button below.  The elements and widgets should only be those applicable to SVG images, adding other none-SVG compatible widgets will no doubt produce odd results!",
  "page.23609": "You can choose an item to insert here.\r\n\r\nText - a text string which you can edit\r\n\r\nTextBlock - a reference to a TextBlock\r\n\r\nHTML symbol - such as &amp;uarr; which will be translated as an up arrow &uarr;\r\n\r\nComment - a string which will appear in the page source code as a comment.\r\n\r\nHTML element - a tag block such as a &lt;div&gt;\r\n\r\nWidget - which will lead you through widget modules to choose a widget\r\n\r\nSection - a section name with an alias. (Only available if this insertion point is not itself within a section)",
  "page.24001": "A TextBlock is defined by a reference label, and each TextBlock can have multiple associated language strings, such as \"en\" and \"fr\", each with a corresponding block of text in that language.\r\n\r\nA TextBlock with this reference label can then be inserted into your pages, typically within a paragraph, and then when the page is displayed the associated block of text will be shown.\r\n\r\nIf a language has been chosen (usually the default language set in the browser) and if the appropriate language text is available in your TextBlock, then that particular text will be displayed.\r\n\r\nThis page allows you to create a new TextBlock, by setting a reference string, or you can edit or remove existing TextBlocks.\r\n\r\nChoosing a reference string with a '.' in it allows you to group TextBlocks together for easier management, so for example you may make TextBlock's with reference string 'subject.topic1' and a second with 'subject.topic2'.  In this case the two TextBlocks will be grouped together on this page under 'subject...'",
  "page.24005": "This page shows TextBlocks in this group where a group is just a namespace derived from '.' characters in the reference string.\r\n\r\nFurther subgroups - using further '.' characters in the reference string can also be viewed here.",
  "page.24019": "This allows you to choose a language, and the text that will appear at this TextBlock position for users of that language.\r\n\r\nThe user's language is initially taken from a language cookie, if one is set, and then the client browser's language setting if no cookie is set. If no text has been added for the clients preferred language, the project default language is tried, and then 'en'. If no text is available for any of these, then the failure text - set when adding a TextBlock to a page - will be shown. ",
  "page.25001": "The skipole framework expects certain pages to exist, and uses these pages - for example to show a server error.\r\n\r\nRather than set these special pages with fixed idents, the system uses a dictionary of labels to idents. This allows you at any time to change these labels to point to other idents and hence force the system to use alternative pages.\r\n\r\nIt may also be useful to use labels with external URL's rather than idents, particularly to link to external javascript libraries.\r\n\r\nYou can set these system pages here, and you can also add your own labels and idents if you find them useful. Note, idents are usually the ident number of a page of this project, but can also be the ident number of a sub project if the ident is given as \"subprojectname, number\" or \"subprojectname, label\". In the latter case, the label is the label given to the ident within the sub-project.\r\n\r\nMost projects should include the 'lib' sub project, which contains javascript modules for the skipole widgets. Links to these labels, and hence modules are automatically added to the 'head' section of template pages as widgets are created. Normally you should simply not alter these labels and links, however for high performance it would be possible to serve these files via a dedicated static server, in which case these labels would be altered to point to URL's rather than to the lib sub project.\r\n\r\nYou can also set your own default CSS and javascript file labels which will cause css and script links to these files to be added automatically in the 'head' section when you create new template pages.",
  "page.26009": "You can edit a Responder here. A 'Responder' is a script that typically takes several parameters, does some action, and then passes the call on to a target page.\r\n\r\nThe target could be another responder (which takes further actions), or could be the final page to be returned to the caller, such as a JSON or Template page.\r\n\r\nSeveral Responders are available to use. Some check submitted data, and typically place submitted values into the call_data dictionary, others call your own 'submit_data' function.",
  "page.27009": "Very often it is necessary to repeat a block of html across multiple pages - for a navigation or footer perhaps.\r\n\r\nSections created here are blocks of html and widgets which are added to the project under a section name, and then can be inserted into a page, with an 'alias name'.  The alias is used so that a section can be added multiple times to a page, with different unique names.\r\n\r\nSubsequent editing of a section here will then change the section code in all pages containing the section.\r\n\r\nTo create a new section, enter a section name, which should be alphanumeric, and can contain underscore characters. Do not give a name such as 'head' or 'body' which may cause confusion.",
  "page.27010": "You can create a new section by specifying the top tag, in which case a section will be created with this tag, and then you will be able to edit the section to add further contents.\r\n\r\nAlternatively, if you have previously downloaded a section definition file, you can choose to upload it - in which case it will be created and given the new name here.  This is a method of copying a section, and also provides the opportunity to manually edit the section definition JSON file which should be reasonably self explanatory if inspected.",
  "page.27049": "You can insert html tags, symbols, widgets, text and TextBlocks into the section.\r\n\r\nIn general, html tags and their attributes are static, in that they cannot be changed dynamically via your Python functions.\r\n\r\nWidgets however have a number of fields which can be changed by setting the page_data dictionary.\r\n\r\nThe 'widfield' keys in page_data reference the field of any widget set here with a tuple:\r\n\r\npage_data['alias name','widget name','field name']='new field value'\r\n\r\nNote that the section 'alias name' is not the section name specified here, it is the alias given when a section is inserted into a page. This alias allows multiple copies of a section to be inserted into a page, each with a different alias.\r\n\r\nIt is also possible to dynamically set the 'show', 'hide' and 'section_class' fields of the section top tag, so if you do not wish to include the entire section:\r\n\r\npage_data['alias name', 'show'] = False\r\n\r\nor if you just wish to hide it:\r\n\r\npage_data['alias name', 'hide'] = True\r\n\r\nOr if you wish to set the CSS class of the section top tag:\r\n\r\npage_data['alias name', 'section_class'] = 'myclass'\r\n\r\nNote: the hide and section_class fields can be set by JSON call.",
  "page.28309": "Edit the selector properties and press submit, or return to the page by choosing the 'CSS Page' button.\r\n\r\nEach property line should be of format:\r\nproperty : value;\r\n\r\nFor example:\r\n\r\nfont-size : 12px;\r\nmargin : 0;\r\npadding : 0;",
  "page.51019": "Set the text to appear on the page here. Newlines will appear as <br /> elements.",
  "page.51209": "You can edit a comment here, which will be placed in the html source code of the page.",
  "page.52019": "This page can be used to set the reference string of the TextBlock on the page.\r\n\r\nWhen the page is displayed, the reference string is used to look up the associated TextBlock text.  If no TextBlock is found, the text given in the field \"TextBlock not found message\" is displayed.\r\n\r\nThe text of the TextBlock can be displayed with any linebreaks converted to HTML linebreaks, it can also be set to escape HTML character codes in the text - or if not escaped, they will be displayed as HTML.",
  "page.53009": "You can set the element's attributes and values here. For example, an attribute could be 'class' and the value would be a CSS class to apply to the element.\r\n\r\nWhen setting values do not include surrounding quote marks, these will be inserted automatically.\r\n\r\nAs a special case, if an attribute value starts with a string in curly brackets, such as {label}, and if the string ('label' in this case) is a label pointing to page or URL, then the URL or page URL will be inserted here when this element is sent to the client browser.  This allows you to create links to pages with attribute href, and destination {target}.\r\n\r\nHence changing the label target page will conveniently change all your links which have been configured in this way.",
  "page.53509": "You can create an html element here, such as a <div> or <p> tag. This will appear on the page, and you will then be able edit it, to add attributes, or insert further contents within it if it is of the form <tag> ...</tag>.\r\n\r\nYou have the option here to create tags of the form <tag /> - which can also have attributes, but do not contain further contents.",
  "page.54009": "The widget name and a brief description can be set here. Also the widget fields are listed, and can be chosen to be set with a value, which can be overwritten by page_data if required.\r\n\r\nIf a widget field requires a list or dictionary as its value, then it must be set via page_data rather than a value being set here.\r\n\r\nThe widget fields can also be re-named if required.",
  "page.54509": "This page lists widget modules. Each module holds a number of widgets, choose a module and you will then be able to choose a widget from that module.",
  "page.54519": "These are the widgets available in this module.",
  "page.54529": "The widget needs a name, unique to the page or section in which it is contained. This name will form part of the 'widgfield' key in the page_data dictionary when setting field values.\r\n\r\nA brief description should also be set - describing how the widget is being used, this is for your own documentation.\r\n\r\nThe rest of this page shows the fields of this widget.  They cannot be edited here, but can be set once the widget has been created. They are shown here to help illustrate the widget functionality.",
  "page.55009": "This is a Section 'place holder'. When the page is loaded, the section (previously defined under 'Manage Sections') is set into this page at this point. The section is then given an alias, so the widget fields within the section can be referred to using the widgfield of ('section_alias_name', 'widget_name', 'field_name').\r\n\r\nAs a special case, your submit_data can set a widgfield key into page_data of ('section_alias_name', 'show') with a value of True or False, - in other words, the section place holder itself has a single field of 'show'. This can be used to dynamically include the section, or not, at run time. As default the value is True.",
  "page.55509": "If you have previously created one or more sections, this feature allows you to insert a section.\r\n\r\nYou will need to choose a section name alias, which must be unique within the page - this will then be the new section name used by widgfields.\r\n\r\nThis allows you to insert a section multiple times within one page, each with a different name.",
  "page.56309": "Validators are test functions that will be applied against received data. Several validators are available, grouped into modules, pick a module to view validators available within it.",
  "page.56319": "Lists the validators available in this module, choose one to add it to the widget field.",
  "page.70101": "This page describes where your Python code should be located, and the functions you should provide, with their arguments and return values.\r\n\r\nThe functions you need to supply are:\r\n\r\nstart_project\r\n\r\nstart_call\r\n\r\nsubmit_data\r\n\r\nend_call\r\n\r\nThe function start_project is called when the project is first loaded, and can typically be used to initiate any startup code you require.\r\n\r\nAs the web server is running, when a user calls the site, the framework will call the other three functions.\r\n\r\nInitially 'start_call' when the call is first received, then optionally one or more calls to 'submit_data' depending on how the call is handled.\r\n\r\nFinally 'end_call', after which data is sent to the client.  In typical operation these functions populate the 'page_data' dictionary which fills in values of a 'TemplatePage'.\r\n\r\nYour __init__.py should import these exceptions:\r\n\r\nfrom .. import FailPage, GoTo, ValidateError, ServerError\r\n\r\nThese can be used by your functions to generate error conditions, or in the case of GoTo, to force a jump to another page.",
  "page.70105": "The skilift package, (located at ...skilift relative to your __init__.py) contains a number of utility functions described here which you may find useful.\r\n\r\nThese functions are used by the 'skiadmin' project. If your final application (which does not include skiadmin) does not call on any of these functions, the 'skilift' package can be deleted from your final installation.\r\n\r\nskilift also contains further modules, used to edit projects, they may be useful in some circumstances, but should not be used if multiple users are accessing your project.",
  "page.70110": "The fromjson module, (located at ...skilift.fromjson relative to your __init__.py) contains functions to create items (such as a page) from JSON strings, and insert the items into a project.\r\n\r\nIt also contains functions to create JSON strings or ordered dictionaries from existing pages.",
  "page.85001": "These operations manipulate multiple pages across your project.\r\n\r\nWidget default CSS classes:\r\nThe first option on this page deals with CSS classes. Widgets have fields of CSS classes which set the look of the widget, and these fields have default values, which are saved in the defaults.json file within the project data directory. The option on this page sets these fields to the default values on all widgets in template pages. Default values are only applied if a default for the widget and field has been set, and only in page widgets - not in sections.\r\n\r\nProject <html> background color:\r\nIn general, the background colour of pages are set in each page 'body' element, however on a slowly loading site, before the body is loaded, it can happen that a brief white page is shown.\r\nOne solution is to set a background colour in the very first 'html' element of the page. Each template page of your project has the option to set this attribute, and for all such pages, you can set the background colour here. This allows you to change this setting across the entire project without editing each page.\r\n\r\nSet CSS class in <body> tags:\r\nThe CSS class of the body tag can be set for all template pages in the project. This allows a drastic CSS change throughout the project if required.\r\n\r\nInsert a css link in each page head:\r\nGiven an element or widget description (the brief), this function finds this element in each 'head' section and inserts a CSS link before it. The target of the link being the label set here.\r\n\r\nSet CSS class in elements with given brief:\r\nGiven an element or widget description (the brief), this function finds each element in each 'body' section, and sets that element class attribute with the given CSS class.",
  "responders.checkers.Accept": "Accepts received raw data and stores in submit_dict beneath a key 'received_data'. Required when received data is not in widgfield format and without ident information. Calls the user submit_data function.",
  "responders.checkers.Accept.final_paragraph": "This responder is intended to allow an incoming call, which does not include page idents and widgfields, to submit data. The data will be in a raw dictionary with field names as keys, and values as either strings or lists of strings.\r\n\r\nAfter calling your submit_data function, the target page will be called next, which could be another responder.\r\n\r\nIf it is not a responder, typically a template page, then your end_call function will be called and the target page widget fields will be filled in from the page_data dictionary.\r\n\r\nIf your submit_data function raises a DataBaseError, then the fail page will be called instead, or if your submit_data raises a GoTo exception, a jump will be made to the page ident specified by the GoTo.",
  "responders.checkers.AllowStore": "For widgfields set here, takes the data from the submitted form, and stores them in the dictionary call_data with keys equal to widgfield tuples submitting the data. Any other widgfield received causes the project Validation error page to be shown. Missing fields are set in call_data with empty values, but are not inserted into received data and hence not validated.",
  "responders.checkers.AllowStore.allowed_callers": "allowed_callers : An optional list of page idents which can call this responder. If the list is empty then any page ident can call the responder.\r\n\r\nThe caller is either the submitting template page (if this is the first responder) or the previous responder passing the call to this page. On failure calls the validation error page.",
  "responders.checkers.AllowStore.fields": "This responder takes a set of widgfields. You should input a widgfield as widget name and field name separated by a comma. Or if the widget is in a section - the widgfield is specified as three elements separated by commas - section name, widget name, field name.\r\n\r\nWhen form data is received, the widgfield and its input data value are received by this responder, any widgfield present which does not appear in this list will be considered unwanted data, and will cause the project validate error page to be called. If no widgfields are given here, the caller must not submit any form data.",
  "responders.checkers.AllowStore.final_paragraph": "Unless an error has occurred, and your submit_data function has not redirected the call, this responder will now pass the data to the target page, which could be another responder, or a page to be returned, such as a JSON or template page.",
  "responders.checkers.AllowStore.submit_list": "When submitted to your submit_data function, any strings set here will be set in the 'submit_list' argument.  These are for your own convenience, and are typically used to identify the source of the call.",
  "responders.checkers.AllowStore.submit_option": "If the submit option is enabled, then this responder will call your submit_data function.",
  "responders.checkers.AllowStore.validate_option": "If the validate option below is enabled, when the form data consisting of widgfields and their contents are received, these contents will be run through validation tests. This requires that the widgfields in the calling page have validators applied to them, which is done by editing the widget fields when designing the calling page. If the validation fails, the data will not be transferred to call_data and the 'validate fail' page specified here will be called.",
  "responders.checkers.AllowStoreKeyed": "For widgfields set here, takes the values from the received form, and stores them in the dictionary call_data with keys equal to widgfield key strings set here. Any other widgfield received causes the project Validation error page to be shown. Missing fields are set in call_data with empty values, but are not inserted into received data and hence not validated.",
  "responders.checkers.AllowStoreKeyed.allowed_callers": "allowed callers : An optional list of page idents which can call this responder. If the list is empty then any page ident can call the responder.\r\n\r\nThe caller is either the submitting template page (if this is the first responder) or the previous responder passing the call to this page. On failure calls the validation error page.",
  "responders.checkers.AllowStoreKeyed.alternate_ident": "alternate page : If the calling page gives no ident information - for example if the call originates from another site, then go to this page.",
  "responders.checkers.AllowStoreKeyed.fields": "The submitted contents of widgfields specified here will be stored in the call_data dictionary under the corresponding keys set here.\r\n\r\nThe widgfields are strings of widgetname, fieldname - or if the widget is in a section, sectionaliasname,widgetname,fieldname.\r\n\r\nThe keys are any string you prefer.",
  "responders.checkers.AllowStoreKeyed.final_paragraph": "This responder is typically used to provide a key in call_data independent of the widget sending the data, and may be useful in a situation where different pages may submit the same data parameter which is handled by a common submit_data function.",
  "responders.checkers.AllowStoreKeyed.submit_list": "When submitted to your submit_data function, any strings set here will be set in the 'submit_list' argument.  These are for your own convenience, and are typically used to identify the source of the call.",
  "responders.checkers.AllowStoreKeyed.submit_option": "If the submit option is enabled, then this responder will call your submit_data function.",
  "responders.checkers.AllowStoreKeyed.target_ident": "target page : The ident of the page which, on success, this responder passes the call onto. Note - the target could be another responder which will continue to process the call.",
  "responders.checkers.AllowStoreKeyed.validate_option": "If the validate option below is enabled, when the form data consisting of widgfields and their contents are received, these contents will be run through validation tests. This requires that the widgfields in the calling page have validators applied to them, which is done by editing the widget fields when designing the calling page. If the validation fails, the data will not be transferred to call_data and the 'validate fail' page specified here will be called.",
  "responders.checkers.AllowedAccept": "Places received data into submit_dict under key 'received_data', unlike Accept, the caller page must provide its ident otherwise alternate page is called. Received data keys are widgfield tuples. Calls the user submit_data function.",
  "responders.checkers.AllowedAccept.final_paragraph": "Any widgfields from any allowed page can be accepted. The caller page must provide its ident, and the received field keys are widgfield tuples.\r\n\r\nAfter calling your submit_data function, the target page will be called next, which could be another responder.\r\n\r\nIf it is not a responder, typically a template page, then your end_call function will be called and the target page widget fields will be filled in from the page_data dictionary.\r\n\r\nIf your submit_data function raises a DataBaseError, then the fail page will be called instead, or if your submit_data raises a GoTo exception, a jump will be made to the page ident specified by the GoTo.",
  "responders.checkers.AllowedFields": "Takes a list of widgfields. Any which do not appear in the submitted form data will be inserted into received data with an empty value, and will pass through validation tests if set. If any widgfield is received which is NOT in this list, it will be considered unwanted data, and will cause the project validate error page to be called. If the submit data option is True, then received data is placed in the submit_dict dictionary, NOT the call_data dictionary, with keys of widgfield tuples.",
  "responders.checkers.AllowedFields.allowed_callers": "allowed callers : An optional list of page idents which can call this responder. If the list is empty then any page ident can call the responder.\r\n\r\nThe caller is either the submitting template page (if this is the first responder) or the previous responder passing the call to this page. On failure calls the validation error page.",
  "responders.checkers.AllowedFields.alternate_ident": "alternate page : If the calling page gives no ident information - for example if the call originates from another site, then go to this page.",
  "responders.checkers.AllowedFields.fields": "This responder takes a set of widgfields. You should input a widgfield as widget name and field name separated by a comma. Or if the widget is in a section - the widgfield is specified as three elements separated by commas - section name, widget name, field name.\r\n\r\nWhen form data is received, the widgfield and its input data value are received by this responder, any widgfield present which does not appear in this list will be considered unwanted data, and will cause the project validate error page to be called. If no widgfields are given here, the caller must not submit any form data.\r\n\r\nIf any of the widgfields set here are not present in the received form data, they will be added, with empty string values.",
  "responders.checkers.AllowedFields.final_paragraph": "Unless an error has occurred, and your submit_data function has not redirected the call, this responder will now pass the data to the target page, which could be another responder, or a page to be returned, such as a JSON or template page.",
  "responders.checkers.AllowedFields.submit_option": "If the submit option is enabled, then this responder will call your submit_data function.",
  "responders.checkers.AllowedFields.target_ident": "target page : The ident of the page which, on success, this responder passes the call onto. Note - the target could be another responder which will continue to process the call.",
  "responders.checkers.AllowedFields.validate_option": "If the validate option below is enabled, when the form data consisting of widgfields and their contents are received, these contents will be run through validation tests. This requires that the widgfields in the calling page have validators applied to them, which is done by editing the widget fields when designing the calling page. If the validation fails the 'validate fail' page specified here will be called.",
  "responders.checkers.PageData": "Sets widgfield:values given here to be inserted into the page_data dictionary.",
  "responders.checkers.PageData.fields": "Set a widgfield as the page_data dictionary key, such as widgetname, fieldname and a value. Only string values can be accepted - so this responder cannot set boolean, lists or dictionaries. Use your python functions to set such items.",
  "responders.checkers.PageData.final_paragraph": "Normally page_data is populated via your own code, however this responder may be useful where some simple static values need to be set, perhaps depending on the page called.",
  "responders.checkers.PrettyFormData": "Places a pretty print string of received widgfield:value's form data into submit_dict with key 'form_data' and pretty print of received raw data into submit_dict with key 'raw_data' and calls user submit_data function.",
  "responders.checkers.PrettyFormData.target_ident": "target_ident : The ident of the page which this responder passes the call onto. Note - the target could be another responder which will continue to process the call.",
  "responders.checkers.StoreData": "For widgfields set here, takes the data from the submitted form, and stores them in the dictionary call_data with keys equal to widgfield tuples submitting the data. Other widgfield received are not set into call_data. Missing fields are set in call_data with empty values, but are not inserted into received data and hence not validated.",
  "responders.checkers.StoreData.target_ident": "target_ident : The ident of the page which, on success, this responder passes the call onto. Note - the target could be another responder which will continue to process the call.",
  "responders.checkers.StoreDataKeyed": "For widgfields set here, takes the data from the submitted form, and stores them in the dictionary call_data.  The dictionary keys used to store these are the values given to the widgfields here.  Other widgfield received are not set into call_data. Missing fields are set in call_data with empty values, but are not inserted into received data and hence not validated.",
  "responders.checkers.StoreDataKeyed.fields": "Please input one or more widgfields, and associated key values.  When data is submitted to this responder, the submitted contents of these widgfields will be added to the call_data dictionary with these keys.",
  "responders.checkers.StoreDataKeyed.final_paragraph": "Please note - this responder does not necessarily move all the submitted data into call_data, it only moves data from the widgfields specified. Nor does this responder call your submit_data function, it simply passes the call on to the target page.",
  "responders.checkers.StoreDataKeyed.target_ident": "target_ident : The ident of the page which, on success, this responder passes the call onto. Note - the target could be another responder which will continue to process the call.",
  "responders.checkers.StoreDataKeyed.validate_option": "If the validate option below is enabled, the widgfields specified here will have their submitted contents validated.  Note - this validation is done on the server, and requires that the widgfields in the calling page have validators applied to them. If the validation fails, the data will not be transferred to call_data and the 'validate fail' page specified here will be called.",
  "responders.navigators.CaseSwitch": "Checks a single submitted widgfield content against a list, and if a match occurs, passes the call to an associated page (or responder). If there is no match, the page (or responder) specified by 'alternate_ident' will be called.",
  "responders.navigators.CaseSwitch.alternate_ident": "alternate_ident: If no match is found, the call goes to the page set here, as either an ident, label or url. However this is not considered an error, and no error message will be raised.",
  "responders.navigators.CaseSwitch.fields": "A list of possible values submitted in the widgfield with corresponding target pages to go to. The target pages can be idents, labels or urls",
  "responders.navigators.CaseSwitch.final_paragraph": "The outcome of this responder is that the call is passed on to a further page (which could be another responder) depending on the value submitted.",
  "responders.navigators.CaseSwitch.widgfield": "The widgfield which is to have its contents checked must be specified, set the widget name and field name separated by a comma. (Or section name, widget name, field name if the widget is part of a section).",
  "responders.navigators.DelCallDataItem": "For a single given key in call_data; if present, that key:value will be deleted from call_data.",
  "responders.navigators.DelCallDataItem.fields": "fields: The key string in call_data which is to be deleted.",
  "responders.navigators.DelCallDataItem.target_ident": "target_ident: Ident of page to go to after the key:value have been deleted.",
  "responders.navigators.EmptyCallDataGoto": "For a single given key in call data, if call_data has that key with an empty value or the key is not present, then passes the call to target_ident, otherwise passes the call to alternate_ident.",
  "responders.navigators.EmptyCallDataGoto.alternate_ident": "alternate_ident: Ident of page to go to if call_data has that key with an non-empty value. This is not an error and error messages will not be shown.",
  "responders.navigators.EmptyCallDataGoto.fields": "fields: The entry here is the key of call_data to check.",
  "responders.navigators.EmptyCallDataGoto.target_ident": "target_ident: Ident of page to go if call_data has that key with an empty value or the key is not present.",
  "responders.navigators.EmptyGoto": "For the given widgfield, if the submitted form has that widgfield with an empty value or the widgfield is not present, then passes the call to target_ident, otherwise passes the call to alternate_ident.",
  "responders.navigators.EmptyGoto.alternate_ident": "alternate_ident: Ident of page to go to if the submitted widgfield contains data. This is not an error and error messages will not be shown.",
  "responders.navigators.EmptyGoto.target_ident": "target_ident: Ident of page to go to if the submitted widgfield is missing or contains empty data. This is not an error and error messages will not be shown.",
  "responders.navigators.EmptyGoto.widgfield": "widgfield: A widget name and field name separated by a comma. This framework will accept this as a tuple of 'widgetname, fieldname'. This defines the field submitted by the original calling template page which is to be checked.",
  "responders.navigators.NoOperation": "Passes the call on to the target page.",
  "responders.navigators.NoOperation.final_paragraph": "Can be used to give an alternate URL to a target page, or as a placeholder while a site is under development, to eventually be replaced later by another responder.",
  "responders.submitters.ColourSubstitute": "Requests a dictionary of keystrings : css colours from submit_data which will be inserted into a target css page substituting the colours for the keystrings.",
  "responders.submitters.ColourSubstitute.final_paragraph": "This responder calls your submit_data function and expects it to return a dictionary.  The dictionary keys should be strings, and the values should be CSS colour strings such as '#FF0000'.  This dictionary is not the 'page_data' dictionary, it should be specifically returned by your submit_data function. \r\n\r\nThe target page of this responder should be a CSS page, you should compose the CSS page to have the keystrings instead of colours in it.  Each keystring should be enclosed in dollar-curly braces, for example ${my_key_string}\r\n\r\nThe responder takes the target CSS page, and substitutes the colour value where the ${keystring} is - hence setting colours in the final CSS page returned. This allows colours to be set dynamically via your submit_data function.",
  "responders.submitters.ColourSubstitute.submit_list": "submit_list: An optional set of strings which you may use, they will appear in the submit_list argument of the submit_data function.",
  "responders.submitters.ColourSubstitute.target_ident": "The target page of this responder should be a CSS page generated by this framework, not a static CSS file page, as the framework is not yet able to parse external CSS pages.",
  "responders.submitters.FieldStoreSubmit": "Takes submitted data from the received form with the given field (regardless of widget name - only uses field name to choose data), and stores the data in the dictionary submit_dict.  The dictionary keys used to store are the widgfield tuple of the submitting widgets.\r\nThen calls the submit_data function, if no fieldname matches are found submit_data is still called, but no widgfield tuple key is inserted into submit_dict.",
  "responders.submitters.FieldStoreSubmit.fields": "Set the fieldname to be searched for.",
  "responders.submitters.FieldStoreSubmit.final_paragraph": "Please note that data is inserted into submit_dict, not call_data.",
  "responders.submitters.FieldStoreSubmit.submit_list": "submit_list: An optional set of strings which you may use, they will appear in the submit_list argument of the submit_data function.",
  "responders.submitters.FieldStoreSubmit.target_ident": "After submit_data is called, the call is passed on to the target page (unless submit_data raises an exception to divert the call elsewhere).",
  "responders.submitters.GetDictionaryDefaults": "Web browsers do not send empty fields, therefore a submitted dictionary may have items missing. This responder calls your submit_data function which should return the expected dictionary with default values. Any missing fields in the form data are then filled in with these defaults.  Any dictionary key recieved which is not in the default dictionary will cause the project validate error page to be called.",
  "responders.submitters.GetDictionaryDefaults.allowed_callers": "allowed_callers : An optional list of page idents which can call this responder. If the list is empty then any page ident can call the responder.",
  "responders.submitters.GetDictionaryDefaults.fail_ident": "fail_ident: If you raise a DataBaseError in your submit_data function then the fail_ident page will be called.",
  "responders.submitters.GetDictionaryDefaults.submit_list": "submit_list: An optional set of strings which you may use, they will appear in the submit_list argument of the submit_data function.",
  "responders.submitters.GetDictionaryDefaults.target_ident": "target_ident : The ident of the page which, on success, this responder passes the call onto. Note - the target could be another responder which will continue to process the call.",
  "responders.submitters.GetDictionaryDefaults.widgfield": "widgfield : The widgfield which will contain the dictionary, input as a widget name and field name separated by a comma, or if the widget is contained within a section; as section name, widget name and field name.",
  "responders.submitters.LanguageCookie": "Calls submit_data and sets a language cookie, that will appear as the preferred language in the 'lang' tuple.",
  "responders.submitters.LanguageCookie.final_paragraph": "Calls submit_data and expects a string to be returned which will be sent with the returned page as a 'language' cookie. The string should be of the standard language tag format, such as 'en' or 'fr-CA'. This will appear in subsequent calls as the preferred language in the 'lang' tuple. The cookie will be set to expire after 30 days.",
  "responders.submitters.LanguageCookie.submit_list": "submit_list: An optional set of strings which you may use, they will appear in the submit_list argument of the submit_data function.",
  "responders.submitters.MediaQuery": "This responder applies a set of Media Queries against target SubmitCSS or CSS pages, setting their contents within media query blocks, and returns an aggregate CSS page of all the blocks.",
  "responders.submitters.MediaQuery.alternate_ident": "If no target page is given, or not recognised, the page given by alternate ident will be returned by this responder.",
  "responders.submitters.MediaQuery.fields": "You should submit a number of media query strings, with targets. So a media string may be something like :\r\n\r\n@media (max-width: 960px)\r\n\r\nand the associated target will be the ident or label of a SubmitCSS responder or CSS page.  Please note: NOT a static CSS file, this framework does not currently extract contentents from such a file.\r\n\r\nGiven a number of such queries, the CSS file returned will be a single file containing each of the targets, wrapped in the appropriate media query block.",
  "responders.submitters.MediaQuery.final_paragraph": "If the submit_data option is chosen, your submit_data should return a dictionary with keys being media query strings (starting with @media..) and values should be page idents or labels of target SubmitCSS responders or CSS pages.",
  "responders.submitters.MediaQuery.submit_list": "submit_list: An optional set of strings which you may use, they will appear in the submit_list argument of the submit_data function.",
  "responders.submitters.MediaQuery.submit_option": "If the submit_data option is enabled, this responder will call your submit_data function which can return a dictionary to update the fields above with further media query:target pairs.",
  "responders.submitters.SetCookies": "Calls submit_data which should return a http.cookies.BaseCookie or http.cookies.SimpleCookie object containing the cookies which will be set in the returned page.",
  "responders.submitters.SetCookies.final_paragraph": "Your code should import the cookies module from the standard library.\r\n\r\nfrom http import cookies\r\n\r\nAnd then your submit_data would typically create a cookies.SimpleCookie object and populate it with the cookies you require to send to the client browser - read the library documentation for details.\r\n\r\nsubmit_data should return the SimpleCookie object, and these cookies will be sent, and in subsequent calls will be returned as key:value strings in the 'received_cookies' dictionary which is an argument to your start_call function.\r\n\r\nThis allows you to specify cookies with the name, value, path and expiration times you require. Be aware that if you use a feature of SimplCookie that has been added in a recent version of Python - you will need to run your project on a web server with that version or later.\r\n",
  "responders.submitters.SubmitCSS": "This responder create a new CSS file. It calls the submit_data function which should return a style which will be set into a dynamically created CSS page. The page_type argument of the end_call function will be SubmitCSS.",
  "responders.submitters.SubmitCSS.final_paragraph": "The style returned by submit_data should be an ordered dictionary with keys being css selectors and values being a list of two element lists acting as css declaration blocks.",
  "responders.submitters.SubmitCSS.submit_list": "submit_list: An optional set of strings which you may use, they will appear in the submit_list argument of the submit_data function.",
  "responders.submitters.SubmitData": "This responder is used in conjunction with previous responders that validates and stores form data in call_data. It calls your submit_data function which should set a dictionary of widgfields:values suitable for the target page in page_data. The function should return None.",
  "responders.submitters.SubmitData.fail_ident": "fail_ident: If you raise a DataBaseError in your submit_data function then the fail_ident page will be called.",
  "responders.submitters.SubmitData.final_paragraph": "After calling your submit_data function, the target page will be called next, which could be another responder.\r\n\r\nIf it is not a responder, typically a template page, then your end_call function will be called and the target page widget fields will be filled in from the page_data dictionary.\r\n\r\nIf your submit_data function raises a FailPage exception, then the fail page will be called instead, or if your submit_data raises a GoTo exception, a jump will be made to the page specified by the GoTo.",
  "responders.submitters.SubmitData.submit_list": "submit_list: An optional set of strings which you may use, they will appear in the submit_list argument of the submit_data function.",
  "responders.submitters.SubmitData.target_ident": "target page: The ident of the page this responder will pass the call to, it could be another responder which in turn will pass the call ultimately to a template page.",
  "responders.submitters.SubmitIterator": "The submit_data function called by this responder should return a binary iterator. The page_type argument of the end_call function will be SubmitIterator.",
  "responders.submitters.SubmitIterator.final_paragraph": "The page_data dictionary can optionally set 'status' and 'headers', or 'mimetype' and 'content-length' if 'headers' is not set.",
  "responders.submitters.SubmitIterator.submit_list": "submit_list: An optional set of strings which you may use, they will appear in the submit_list argument of the submit_data function.",
  "responders.submitters.SubmitJSON": "This responder is intended to provide JSON data as a service to an external application. Your submit_data should return a dictionary, not widgfields, but any data you like which can be transformed to JSON. The page_type argument of the end_call function will be SubmitJSON.",
  "responders.submitters.SubmitPlainText": "This responder is intended to provide plain text as a service to an external application. Your submit_data function should return a string which will be set as the returned contents. The page_type argument of the end_call function will be SubmitPlainText.",
  "skipole.py intro": "Skipole is a web framework, allowing you to create web folders, pages and widgets. These interact with three python functions which you provide. You now have the option of opening a pre-existing project, or creating a new one.",
  "validators.basic.AllowedValuesOnly": "Automatic fail - only passes the allowed values list.",
  "validators.basic.MaxLength": "Checks the length of the submitted value is equal or less than the maximum value given.",
  "validators.basic.MaxLength.maxlength": "The submitted string must have a length equal or less than the integer value given here.",
  "validators.basic.MinLength": "Checks the length of the submitted value is equal or greater than the minimum value given.",
  "validators.basic.MinLength.minlength": "The submitted string must have a length equal or greater than the integer value given here.",
  "validators.basic.NotEmpty": "Checks the submitted value is not empty.",
  "validators.basic.Search": "Regular expression; passes if pattern search found.",
  "validators.basic.Search.pattern": "This is the regular expression, it should be valid for both javascript (on the client side) and Python (on the server side). If a search of this pattern is found, the test is passed.",
  "validators.basic.module": "Basic validators - for simple checks.",
  "validators.description": "This field can accept one or more validators, these are simple data checks that are tested on the value submitted from the form.",
  "validators.description2": "If one or more Validators are added to this field, the form should call a Responder that runs the validation tests on submitted data.\r\n\r\nTypically the validated data will then be stored by the Responder in the call_data dictionary and passed to your submit_data function.",
  "validators.description3": "The display widget is the name of the widget, which, if given, will be used to display the error message should one occur. %s",
  "validators.description4": "A validator can have a list of allowed values, any of these submitted in the field will immediately be passed, anything other than these values must go through the actual validation test.  Do not use 'secret' or back door values here - this list is embedded in the javascript of the page, and can be viewed by a client simply by inspecting the page source code. The purpose of this list is to allow specific exemptions to the test which may be useful in rare circumstances.",
  "validators.description5": "This validator takes the following arguments, choose edit to set the argument value.",
  "validators.modules": "Validators are defined in the following modules, choose a module:",
  "validators.paths.module": "Validators for site folder and page checks.",
  "widgets.arg_dict_desc": "This field can have its name changed (alphanumeric and underscore only) if desired.  The value can be set at run time via the page_data dictionary, with a key of the tuple (\"%s\") and the value being the dictionary to insert here.\r\n\r\nNote: If the widget is contained in a section, the page_data tuple key should be expanded to three elements, with the first element being the section alias within the page.",
  "widgets.arg_list_desc": "This field can have its name changed (alphanumeric and underscore only) if desired.  The value can be set at run time via the page_data dictionary with a key of the tuple (\"%s\") and the value being the list to be set into this field.\r\n\r\nNote: If the widget is contained in a section, the page_data tuple key should be expanded to three elements, with the first element being the section alias within the page.",
  "widgets.arg_table_desc": "This field can have its name changed (alphanumeric and underscore only) if desired.  The value can be set at run time via the page_data dictionary with a key of the tuple (\"%s\") and the value being a list of tuples described above.\r\n\r\nNote: If the widget is contained in a section, the page_data tuple key should be expanded to three elements, with the first element being the section alias within the page.",
  "widgets.args_desc": "The value can be changed at run time by setting the page_data dictionary with a key of the tuple (\"%s\") and the value being the new value to insert here.\r\nNote: If the widget is contained in a section, the page_data tuple key should be expanded to three elements, with the first element being the section alias within the page.",
  "widgets.checkbox.CheckBox1": "A checkbox in a div - but without a form or submit button, typically included within a form.\r\nOn error, a paragraph above the checkbox will display the error message.",
  "widgets.checkbox.CheckBox1.checkbox": "The name of the checkbox, with the value returned.",
  "widgets.checkbox.CheckBox1.checkbox.full": "The name of the checkbox, set the value of this field to the string which will be returned if the checkbox is ticked. Validators can be added to this field.",
  "widgets.checkbox.CheckBox1.checked": "True if checkbox ticked, False otherwise.",
  "widgets.checkbox.CheckBox1.checked.full": "Set this field to True if the checkbox is to be shown ticked, False if unticked.",
  "widgets.checkbox.CheckBox1.div_class": "The CSS class applied to the div after the error paragraph.",
  "widgets.checkbox.CheckBox1.div_class.full": "The CSS class applied to the div which contains the label and checkbox, and is after the hidden error paragraph.",
  "widgets.checkbox.CheckBox1.error_class": "The CSS class applied to the normally hidden error paragraph.",
  "widgets.checkbox.CheckBox1.error_class.full": "The CSS class applied to the normally hidden error paragraph.",
  "widgets.checkbox.CheckBox1.left_class": "The css class of the label to the left of the checkbox.",
  "widgets.checkbox.CheckBox1.left_class.full": "The css class of the label tag to the left of the checkbox. If the field is empty, no class attribute is set.",
  "widgets.checkbox.CheckBox1.left_label": "The text displayed to the left of the checkbox.",
  "widgets.checkbox.CheckBox1.left_label.full": "The text displayed to the left of the checkbox within a 'label' tag. If no text is given no label tag is created. The label tag is given a 'for' attribute with the id of the checkbox input tag.",
  "widgets.checkbox.CheckBox1.right_class": "The css class of the label to the right of the checkbox.",
  "widgets.checkbox.CheckBox1.right_class.full": "The css class of the label tag to the right of the checkbox. If the field is empty, no class attribute is set.",
  "widgets.checkbox.CheckBox1.right_label": "The text displayed to the right of the checkbox.",
  "widgets.checkbox.CheckBox1.right_label.full": "The text displayed to the right of the checkbox within a 'label' tag. If no text is given no label tag is created. The label tag is given a 'for' attribute with the id of the checkbox input tag.",
  "widgets.checkbox.CheckBox2": "A checkbox in a span - but without a form or submit button, typically included within a form. Does not display errors.",
  "widgets.checkbox.CheckBox2.checkbox": "The name of the checkbox, with the value returned.",
  "widgets.checkbox.CheckBox2.checkbox.full": "The name of the checkbox, set the value of this field to the string which will be returned if the checkbox is ticked. Validators can be added to this field.",
  "widgets.checkbox.CheckBox2.checked": "True if checkbox ticked, False otherwise.",
  "widgets.checkbox.CheckBox2.checked.full": "Set this field to True if the checkbox is to be shown ticked, False if unticked.",
  "widgets.checkbox.CheckBox2.left_class": "The css class of the label to the left of the checkbox.",
  "widgets.checkbox.CheckBox2.left_class.full": "The css class of the label tag to the left of the checkbox. If the field is empty, no class attribute is set.",
  "widgets.checkbox.CheckBox2.left_label": "The text displayed to the left of the checkbox.",
  "widgets.checkbox.CheckBox2.left_label.full": "The text displayed to the left of the checkbox within a 'label' tag. If no text is given no label tag is created. The label tag is given a 'for' attribute with the id of the checkbox input tag.",
  "widgets.checkbox.CheckBox2.right_class": "The css class of the label to the right of the checkbox.",
  "widgets.checkbox.CheckBox2.right_class.full": "The css class of the label tag to the right of the checkbox. If the field is empty, no class attribute is set.",
  "widgets.checkbox.CheckBox2.right_label": "The text displayed to the right of the checkbox.",
  "widgets.checkbox.CheckBox2.right_label.full": "The text displayed to the right of the checkbox within a 'label' tag. If no text is given no label tag is created. The label tag is given a 'for' attribute with the id of the checkbox input tag.",
  "widgets.checkbox.CheckedText": "Checkbox and text input field, the checkbox enables or disables the text field. No form or submit capability, intended for insertion into a form.",
  "widgets.checkbox.CheckedText.checkbox": "The field name is the field part of the widgfield data submitted, with the value returned, if any. If value is left empty, no widgfield is submitted.",
  "widgets.checkbox.CheckedText.checked": "True if checkbox ticked, and the text input field is enabled, False if unticked and the input field disabled. JSON settable.",
  "widgets.checkbox.module": "Checkbox widgets and forms.",
  "widgets.clear_error": "If the widget is showing an error, clears the error display.",
  "widgets.clear_error.full": "If True, clears the widget error display. For template pages, and the default setting here, this is normally always False as widget are usually displayed either cleared or in error as required.\r\nThis is generally only used when sending a JSON file and you wish to clear the error condition on the page currently displayed on the client browser.",
  "widgets.confirm.AlertClear1": "A div with a paragraph of text, or error text and one X button which auto hides the div.",
  "widgets.confirm.ConfirmBox1": "A div with a paragraph of text and two buttons, each can call JSON or HTML targets.",
  "widgets.confirm.ConfirmBox1.boxdiv_class": "CSS class of div holding text and buttons.",
  "widgets.confirm.ConfirmBox1.button1_class": "The CSS class of the first button.",
  "widgets.confirm.ConfirmBox1.button1_style": "The CSS style of the first button.",
  "widgets.confirm.ConfirmBox1.button2_class": "The CSS class of the second button.",
  "widgets.confirm.ConfirmBox1.button2_style": "The CSS style of the second button.",
  "widgets.confirm.ConfirmBox1.button_text1": "Text shown on the first button.",
  "widgets.confirm.ConfirmBox1.button_text2": "Text shown on the second button.",
  "widgets.confirm.ConfirmBox1.buttondiv_class": "CSS class of div holding the two buttons.",
  "widgets.confirm.ConfirmBox1.get_field1_1": "First get field of the first button. Can be set by JSON.",
  "widgets.confirm.ConfirmBox1.get_field1_2": "Second get field of the first button. Can be set by JSON.",
  "widgets.confirm.ConfirmBox1.get_field1_3": "Third get field of the first button. Can be set by JSON.",
  "widgets.confirm.ConfirmBox1.get_field2_1": "First get field of the second button. Can be set by JSON.",
  "widgets.confirm.ConfirmBox1.get_field2_2": "Second get field of the second button. Can be set by JSON.",
  "widgets.confirm.ConfirmBox1.get_field2_3": "Third get field of the second button. Can be set by JSON.",
  "widgets.confirm.ConfirmBox1.hide": "If True, sets display: none; on the widget, can be set/unset via JSON file.",
  "widgets.confirm.ConfirmBox1.json_ident1": "The link ident or label of the first button JSON target, if given does not call link_ident1.",
  "widgets.confirm.ConfirmBox1.json_ident2": "The link ident or label of the second button JSON target, if given does not call link_ident2.",
  "widgets.confirm.ConfirmBox1.link_ident1": "The link ident or label of the first button HTML target.",
  "widgets.confirm.ConfirmBox1.link_ident2": "The link ident or label of the second button HTML target.",
  "widgets.confirm.ConfirmBox1.para_class": "CSS class of the text paragraph.",
  "widgets.confirm.ConfirmBox1.para_text": "The paragraph text, can be set by JSON.",
  "widgets.confirm.ConfirmBox1.paradiv_class": "CSS class of div holding the text paragraph.",
  "widgets.confirm.ConfirmBox2": "A div with a paragraph of text and two buttons. One button auto hides the div.",
  "widgets.confirm.ConfirmBox2.boxdiv_class": "CSS class of div holding text and buttons.",
  "widgets.confirm.ConfirmBox2.button1_class": "The CSS class of the first button.",
  "widgets.confirm.ConfirmBox2.button1_style": "The CSS style of the first button.",
  "widgets.confirm.ConfirmBox2.button2_class": "The CSS class of the second button.",
  "widgets.confirm.ConfirmBox2.button2_style": "The CSS style of the second button.",
  "widgets.confirm.ConfirmBox2.button_text1": "Text shown on the first button.",
  "widgets.confirm.ConfirmBox2.button_text2": "Text shown on the second button.",
  "widgets.confirm.ConfirmBox2.buttondiv_class": "CSS class of div holding the two buttons.",
  "widgets.confirm.ConfirmBox2.get_field1_1": "First get field of the first button. Can be set by JSON.",
  "widgets.confirm.ConfirmBox2.get_field1_2": "Second get field of the first button. Can be set by JSON.",
  "widgets.confirm.ConfirmBox2.get_field1_3": "Third get field of the first button. Can be set by JSON.",
  "widgets.confirm.ConfirmBox2.get_field2_1": "First get field of the second button. Can be set by JSON.",
  "widgets.confirm.ConfirmBox2.get_field2_2": "Second get field of the second button. Can be set by JSON.",
  "widgets.confirm.ConfirmBox2.get_field2_3": "Third get field of the second button. Can be set by JSON.",
  "widgets.confirm.ConfirmBox2.hide": "If True, sets display: none; on the widget, can be set/unset via JSON file.",
  "widgets.confirm.ConfirmBox2.link_ident1": "The link ident or label of the first button target.",
  "widgets.confirm.ConfirmBox2.link_ident2": "The link ident or label of the second button target.",
  "widgets.confirm.ConfirmBox2.para_class": "CSS class of the text paragraph.",
  "widgets.confirm.ConfirmBox2.para_text": "The paragraph text, can be set by JSON.",
  "widgets.confirm.ConfirmBox2.paradiv_class": "CSS class of div holding the text paragraph.",
  "widgets.confirm.module": "Buttons and links providing options to confirm, accept, cancel.",
  "widgets.css_default_desc": "The value specified can be set as a default value for the Widget and field for this project. Any new widgets of this type will initially be set with this value.\r\n\r\nThis enables a project to be created, which, together with a page that can be copied and a CSS file, can act as a 'template' project.",
  "widgets.debug_tools.ShowCallData": "A div showing the call_data dictionary.",
  "widgets.debug_tools.ShowCallData.para_class": "The CSS class of an optional text paragraph appearing above the call_data display.",
  "widgets.debug_tools.ShowCallData.toptext": "Text appearing in an optional paragraph above the displayed call_data.",
  "widgets.debug_tools.ShowEnviron": "A div showing the environ dictionary.",
  "widgets.debug_tools.ShowResponders": "A div containing a table with columns showing the responders called to access this page.",
  "widgets.debug_tools.module": "Used to aid debugging, for example, displaying the environ dictionary.",
  "widgets.dropdown.module": "Widgets displaying dropdown forms.",
  "widgets.error_messages.ErrorClear1": "Hidden div holding inner divs of text and clear button which hides the widget.",
  "widgets.error_messages.ErrorClear1.boxdiv_class": "CSS class of a div within the widget div.",
  "widgets.error_messages.ErrorClear1.boxdiv_class.full": "CSS class of a div within the widget div. Can be used together with the widget div to create a modal box",
  "widgets.error_messages.ErrorClear1.button_class": "The CSS class of the clear button.",
  "widgets.error_messages.ErrorClear1.button_text": "Button text on the clear button.",
  "widgets.error_messages.ErrorClear1.buttondiv_class": "CSS class of inner div holding the clear button.",
  "widgets.error_messages.ErrorClear1.buttondiv_style": "CSS style of inner div holding the clear button.",
  "widgets.error_messages.ErrorClear1.error_class": "CSS class of inner div holding the paragraph of text.",
  "widgets.error_messages.ErrorClear1.get_field1": "Optional get field data sent by the clear button if no javascript. JSON settable.",
  "widgets.error_messages.ErrorClear1.get_field2": "Optional get field data sent by the clear button if no javascript. JSON settable.",
  "widgets.error_messages.ErrorClear1.get_field3": "Optional get field data sent by the clear button if no javascript. JSON settable.",
  "widgets.error_messages.ErrorClear1.hide": "Normally True, which hides the widget.",
  "widgets.error_messages.ErrorClear1.hide.full": "Normally set to True, which hides the widget by setting display:none; on the widget. If False, the widget is displayed. This field can be set or unset via JSON. When an error is raised on the widget this hide value is overidden, and the widget and message is displayed.",
  "widgets.error_messages.ErrorClear1.link_ident": "Called by the clear button if no javascript.",
  "widgets.error_messages.ErrorClear1.link_ident.full": "Normally the clear button hides the widget using javascript, and no call is made. If the client browser has javascript disabled, then a call to this ident is made.",
  "widgets.error_messages.ErrorClear1.para_text": "Text shown if no error raised, Can be set by JSON.",
  "widgets.error_messages.ErrorClear1.pre_line": "If True, preserves new line breaks in the text.",
  "widgets.error_messages.ErrorClear2": "Hidden div holding inner div of error message and X button which hides the widget.",
  "widgets.error_messages.ErrorClear2.boxdiv_class": "CSS class of a div within the widget div.",
  "widgets.error_messages.ErrorClear2.boxdiv_class.full": "CSS class of a div within the widget div. Can be used together with the widget div to create a modal box",
  "widgets.error_messages.ErrorClear2.button_class": "The CSS class of the X button.",
  "widgets.error_messages.ErrorClear2.buttondiv_class": "CSS class of inner div holding the X button.",
  "widgets.error_messages.ErrorClear2.buttondiv_style": "CSS style of inner div holding the X button.",
  "widgets.error_messages.ErrorClear2.error_class": "CSS class of inner div holding the paragraph of text.",
  "widgets.error_messages.ErrorClear2.get_field1": "Optional get field data sent by the clear button if no javascript. JSON settable.",
  "widgets.error_messages.ErrorClear2.get_field2": "Optional get field data sent by the clear button if no javascript. JSON settable.",
  "widgets.error_messages.ErrorClear2.get_field3": "Optional get field data sent by the clear button if no javascript. JSON settable.",
  "widgets.error_messages.ErrorClear2.hide": "Normally True, which hides the widget.",
  "widgets.error_messages.ErrorClear2.hide.full": "Normally set to True, which hides the widget by setting display:none; on the widget. If False, the widget is displayed. This field can be set or unset via JSON. When an error is raised on the widget this hide value is overidden, and the widget and message is displayed.",
  "widgets.error_messages.ErrorClear2.link_ident": "Called by the clear button if no javascript.",
  "widgets.error_messages.ErrorClear2.link_ident.full": "Normally the clear button hides the widget using javascript, and no call is made. If the client browser has javascript disabled, then a call to this ident is made.",
  "widgets.error_messages.ErrorClear2.pre_line": "If True, preserves new line breaks in the error message.",
  "widgets.error_messages.ErrorDiv": "A div containing a paragraph containing error text - normally the div is hidden.\r\nOn displaying an error, the paragraph text is changed to the error message and\r\nthe div is made visible.",
  "widgets.error_messages.ErrorDiv.error_class": "The CSS class of the paragraph.",
  "widgets.error_messages.ErrorDiv.error_class.full": "Sets the CSS class of the paragraph (not the outside div).",
  "widgets.error_messages.ErrorDiv.hide": "Normally True, which hides the widget.",
  "widgets.error_messages.ErrorDiv.hide.full": "Normally set to True, which hides the widget by setting display:none; on the widget. If False, the widget is displayed. This field can be set or unset via JSON. When an error is raised on the widget this hide value is overidden, and the widget and message is displayed.",
  "widgets.error_messages.ErrorPara": "A paragraph containing error text - normally hidden, displayed on error.",
  "widgets.error_messages.ErrorPara.hide": "Normally True, which hides the widget.",
  "widgets.error_messages.ErrorPara.hide.full": "Normally set to True, which hides the widget by setting display:none; on the widget. If False, the widget is displayed. This field can be set or unset via JSON. When an error is raised on the widget this hide value is overidden, and the widget and message is displayed.",
  "widgets.error_messages.module": "Used to display error messages.",
  "widgets.footers.SimpleFooter": "A div, holding a paragraph of text.",
  "widgets.footers.SimpleFooter.error_class": "CSS class set to the first paragraph within the div. This paragraph is normally hidden, and shown on error.",
  "widgets.footers.SimpleFooter.error_class.full": "CSS class set to the first paragraph within the div. This paragraph is normally hidden, and shown on error and displays the error message.",
  "widgets.footers.SimpleFooter.footer_text": "The text appearing in the second paragraph within the div. Can be set by JSON.",
  "widgets.footers.SimpleFooter.footer_text.full": "The text to be shown in the second paragraph within the div. As the first paragraph is normally hidden, this text is the text on show. It can also be set via a JSON file.",
  "widgets.footers.SimpleFooter.para_class": "The CSS class set on the second paragraph within the div, which holds the footer text.",
  "widgets.footers.SimpleFooter.para_class.full": "The CSS class applied to the second paragraph within the div and which contains the footer text.",
  "widgets.footers.module": "Defines widgets which may be used as, or within, page footers",
  "widgets.headers.HeaderErrorPara": "A paragraph containing error text - normally hidden, displayed on error.",
  "widgets.headers.HeaderText1": "A div containing h1 text, followed by a paragraph of text, and a normally hidden error paragraph.  Th h1 and p text are JSON settable.",
  "widgets.headers.NavButtons1": "A div, with a normally hidden error paragraph followed by a list of navigation buttons.",
  "widgets.headers.NavButtons1.nav_links": "A list of lists. Each inner list describing a link, the name of this field is used as the widgfield for any data returned in the get field of the links.",
  "widgets.headers.NavButtons1.nav_links.full": "A list of lists. Each inner list describing a link, the name of this field is used as the widgfield for any data returned in the get field of the links.\r\n\r\nEach inner list should have four elements:\r\n\r\n 0 : The url, label or ident of the target page of the link\r\n 1 : The displayed text of the link\r\n 2 : If True, ident_data is sent with the link even if there is no get field data\r\n 3 : The get field data to send with the link\r\n",
  "widgets.headers.module": "Widgets to be typically used in a page header section.",
  "widgets.info.PageIdent": "A span displaying the ident of the page containing the widget. The ident can be overwriiten if the field page_ident is given a value. ",
  "widgets.info.PageIdent.page_ident": "Normally left empty, but if set to a tuple 'projectname',pagenumber it will display those values.",
  "widgets.info.Redirector": "A widget containing javascript which redirects\nthe page to the given url. Once the page is loaded, the redirection occurs,\nso normally this is the only widget on the page.\nA TextBlock is displayed with the link to the url if\nthe client has javascript disabled",
  "widgets.info.Redirector.text_refnotfound": "If the TextBlock is not found, this text is used instead.",
  "widgets.info.Redirector.text_replaceblock": "If text is set here, it will be used instead of a TextBlock.",
  "widgets.info.Redirector.textblock_ref": "The reference of a TextBlock which is displayed\nwith the link to the url if the client has javascript disabled.",
  "widgets.info.Redirector.url": "The external URL to which this widget will redirect.\nShould include the http:// prefix.",
  "widgets.info.ServerTimeStamp": "A span containing the server date and time.",
  "widgets.info.ServerTimeStamp.timestamp": "Normally empty, any text given here will replace the automatically generated timestamp. JSON settable.",
  "widgets.info.ServerTimeStamp.utc": "If True, time is UTC, if False it is server local time",
  "widgets.info.module": "Widgets which display information - for example timestamp, page ident, etc.",
  "widgets.inputforms.Form1": "A form without content, used to contain input fields and submit button.",
  "widgets.inputforms.HiddenField": "An input field of type hidden, typically inserted into forms, the value can be set by JSON.",
  "widgets.inputforms.HiddenField.hidden_field": "This field value is the 'value' attribute of this input field to be sent when the enclosing form is submitted.",
  "widgets.inputforms.HiddenField.hidden_field.full": "Typically this widget is included in a form, and the value of this field is the value returned to the server when the form is submitted. The value can be set here, or via a Responder, or by a JSON call.",
  "widgets.inputforms.SubmitButton1": "An input field of type submit, with name attribute, for use as an insert into form widgets",
  "widgets.inputforms.SubmitButton2": "An input field of type submit, no name, so does not submit a widgfield, for use as an insert into form widgets",
  "widgets.inputforms.SubmitForm1": "A form taking contents with submit button and four hidden fields - generally used with\r\nfurther input fields set within it.",
  "widgets.inputforms.SubmitForm1.action": "The form destination - either a responder page ident or label.",
  "widgets.inputforms.SubmitForm1.action.full": "This field sets the 'action' attribute of the form tag. Either a responder page ident, or page label (if the target responder page has been given a label) should be input here, and at run time this will be converted to the correct URL.  Normally you would set the action to call a responder page - or the first in a series of responders, that check the correct fields have been submitted, validates them, stores the results in the call_data dictionary, then submits the data to your code.",
  "widgets.inputforms.SubmitForm1.button_text": "The text on the submit button.",
  "widgets.inputforms.SubmitForm1.container0": "Content can be placed immediately within the form tag (after the hidden error div), generally useful for setting input fields, which will be submitted with the form.",
  "widgets.inputforms.SubmitForm1.div_class": "The CSS class attribute of the div tag which contains the label and button.",
  "widgets.inputforms.SubmitForm1.error_class": "The CSS class applied to the paragraph containing the error message on error.",
  "widgets.inputforms.SubmitForm1.hidden_field1": "A hidden field value, leave blank if unused, this field name is used as the submitted field name",
  "widgets.inputforms.SubmitForm1.hidden_field2": "A second hidden field value, leave blank if unused, this field name is used as the submitted field name",
  "widgets.inputforms.SubmitForm1.hidden_field3": "A third hidden field value, leave blank if unused, this field name is used as the submitted field name",
  "widgets.inputforms.SubmitForm1.hidden_field4": "A fourth hidden field value, leave blank if unused, this field name is used as the submitted field name",
  "widgets.inputforms.SubmitForm1.left_class": "The class attribute of the left_label",
  "widgets.inputforms.SubmitForm1.left_label": "The label appearing adjacent and to the left of the submit button",
  "widgets.inputforms.SubmitForm1.right_class": "The class attribute of the right_label",
  "widgets.inputforms.SubmitForm1.right_label": "The label appearing adjacent and to the right of the submit button",
  "widgets.inputforms.module": "Various input forms, with submit buttons.",
  "widgets.inputtables.InputTable5": "A div containing rows of forms. Each form has label, text input field, two buttons and four hidden fields.",
  "widgets.inputtables.InputTable5.col_input": "A list of text strings, to be inserted into the input fields, the length of the list defines the number of rows.",
  "widgets.inputtables.InputTable5.col_label": "A list of text strings, to be inserted into the labels, the length of the list defines the number of rows.",
  "widgets.inputtables.InputTable5.set_input_accepted": "Dictionary of integer keys, being row numbers and True or False values which set the input accepted CSS class.",
  "widgets.inputtables.InputTable5.set_input_accepted.full": "A Dictionary with keys being integers, and values being either True or False. The integer number references the input row (starting at zero) - and if True, the input accepted CSS class is applied to that row input field, if False it is removed.\r\n\r\nThis allows just one, or more rows to have the CSS class set by setting the dictionary to contain just those rows to be altered.",
  "widgets.inputtables.InputTable5.set_input_errored": "Dictionary of integer keys, being row numbers and True or False values which set the input errored CSS class.",
  "widgets.inputtables.InputTable5.set_input_errored.full": "A Dictionary with keys being integers, and values being either True or False. The integer number references the input row (starting at zero) - and if True, the input errored CSS class is applied to that row input field, if False it is removed.\r\n\r\nThis allows just one, or more rows to have the CSS class set by setting the dictionary to contain just those rows to be altered.",
  "widgets.inputtables.module": "Tables with input fields.",
  "widgets.inputtext.Password1": "A password input field only, no form, label or submit button. For insertion into a form widget container.",
  "widgets.inputtext.Password1.disabled": "Set True if the field is to be disabled.",
  "widgets.inputtext.Password1.disabled.full": "Set True if the field is to be disabled.",
  "widgets.inputtext.Password1.input_accepted_class": "A class which can be added to the input field.",
  "widgets.inputtext.Password1.input_accepted_class.full": "A class which will be added to the input field if 'set_input_accepted' is set to True. If widget_class is set, then this class will be added to the class list of the input field, it will not replace widget_class.",
  "widgets.inputtext.Password1.input_errored_class": "A class which can be added to the input field.",
  "widgets.inputtext.Password1.input_errored_class.full": "A class which will be added to the input field if 'set_input_errored' is set to True. If widget_class is set, then this class will be added to the class list of the input field, it will not replace widget_class.",
  "widgets.inputtext.Password1.input_text": "The name of the input text field, with default value.",
  "widgets.inputtext.Password1.input_text.full": "The name of the input text field, set the value of this field to the default value shown in the field, the user will change this value which will then be returned. Validators can be added to this field.",
  "widgets.inputtext.Password1.maxlength": "The maximum number of characters accepted in the text input field.",
  "widgets.inputtext.Password1.maxlength.full": "The maximum number of characters accepted in the text input field.",
  "widgets.inputtext.Password1.required": "Set True to put the 'required' attribute into the input field.",
  "widgets.inputtext.Password1.required.full": "Set True to put the 'required' attribute into the input field.",
  "widgets.inputtext.Password1.set_input_accepted": "Enable the input_accepted class.",
  "widgets.inputtext.Password1.set_input_accepted.full": "If set to True the input_accepted_class will be added to the class list of the input field.",
  "widgets.inputtext.Password1.set_input_errored": "Enable the input_errored class.",
  "widgets.inputtext.Password1.set_input_errored.full": "If set to True the input_errored_class will be added to the class list of the input field.",
  "widgets.inputtext.Password1.size": "The number of characters appearing in the text input field.",
  "widgets.inputtext.Password1.size.full": "The number of characters appearing in the text input field.",
  "widgets.inputtext.Password2": "Defines a div containing a hidden error paragraph followed by a password input field (no form or submit button). A label to the left of the input field can have a class and content set.",
  "widgets.inputtext.Password2.disabled": "Set True if the field is to be disabled.",
  "widgets.inputtext.Password2.disabled.full": "Set True if the field is to be disabled.",
  "widgets.inputtext.Password2.error_class": "The class applied to the hidden paragraph on error.",
  "widgets.inputtext.Password2.error_class.full": "The CSS class applied to the hidden paragraph on error.",
  "widgets.inputtext.Password2.input_text": "The name of the input password field, with default value.",
  "widgets.inputtext.Password2.input_text.full": "The name of the input text field, set the value of this field to the default value shown in the field, the user will change this value which will then be returned. Validators can be added to this field.",
  "widgets.inputtext.Password2.label": "The text displayed to the left of the input password field.",
  "widgets.inputtext.Password2.label.full": "The text displayed to the left of the input password field within a 'label' tag. If no text is given no label tag is created. The label tag is given a 'for' attribute with the id of the input password field.",
  "widgets.inputtext.Password2.label_class": "A CSS class for the label.",
  "widgets.inputtext.Password2.label_class.full": "A CSS class for the label",
  "widgets.inputtext.Password2.maxlength": "The maximum number of characters accepted in the password input field.",
  "widgets.inputtext.Password2.maxlength.full": "The maximum number of characters accepted in the password input field.",
  "widgets.inputtext.Password2.required": "Set True to put the 'required' attribute into the input field.",
  "widgets.inputtext.Password2.required.full": "Set True to put the 'required' attribute into the input field.",
  "widgets.inputtext.Password2.size": "The number of characters appearing in the password input field.",
  "widgets.inputtext.Password2.size.full": "The number of characters appearing in the password input field.",
  "widgets.inputtext.SubmitTextInput1": "A form with a text input field, and four hidden fields.",
  "widgets.inputtext.SubmitTextInput1.action": "The form destination, if action_json not set - either a responder page ident or label.",
  "widgets.inputtext.SubmitTextInput1.action.full": "This field sets the 'action' attribute of the form tag. Either a responder page ident, or page label (if the target responder page has been given a label) should be input here, and at run time this will be converted to the correct URL.  Normally you would set the action to call a responder page - or the first in a series of responders, that check the correct fields have been submitted, validates them, stores the results in the call_data dictionary, then submits the data to your code.",
  "widgets.inputtext.SubmitTextInput1.action_json": "The form destination - either a responder page ident or label, requires JSON page returned.",
  "widgets.inputtext.SubmitTextInput1.button_class": "The class of the submit button.",
  "widgets.inputtext.SubmitTextInput1.button_class.full": "The class of the submit button. This gives the opportunity to define a button via CSS.",
  "widgets.inputtext.SubmitTextInput1.button_text": "The text on the button.",
  "widgets.inputtext.SubmitTextInput1.button_text.full": "The text on the button.",
  "widgets.inputtext.SubmitTextInput1.error_class": "The class applied to the paragraph containing the error message on error.",
  "widgets.inputtext.SubmitTextInput1.error_class.full": "The class applied to the normally hidden paragraph containing the error message. On error this paragraph is displayed.",
  "widgets.inputtext.SubmitTextInput1.hidden_field1": "A hidden field value, leave blank if unused, this field name is used as the submitted field name",
  "widgets.inputtext.SubmitTextInput1.hidden_field1.full": "A hidden field value, leave blank if unused, this field name is used as the submitted field name",
  "widgets.inputtext.SubmitTextInput1.hidden_field2": "A second hidden field value, leave blank if unused, this field name is used as the submitted field name",
  "widgets.inputtext.SubmitTextInput1.hidden_field2.full": "A second hidden field value, leave blank if unused, this field name is used as the submitted field name",
  "widgets.inputtext.SubmitTextInput1.hidden_field3": "A third hidden field value, leave blank if unused, this field name is used as the submitted field name",
  "widgets.inputtext.SubmitTextInput1.hidden_field3.full": "A third hidden field value, leave blank if unused, this field name is used as the submitted field name",
  "widgets.inputtext.SubmitTextInput1.hidden_field4": "A fourth hidden field value, leave blank if unused, this field name is used as the submitted field name",
  "widgets.inputtext.SubmitTextInput1.hidden_field4.full": "A fourth hidden field value, leave blank if unused, this field name is used as the submitted field name",
  "widgets.inputtext.SubmitTextInput1.hide": "If True, widget is hidden. Can be set by JSON.",
  "widgets.inputtext.SubmitTextInput1.hide.full": "If True the widget is hidden, if False it is displayed. As it is JSON settable this can be used to dynamically hide or display a widget via JSON.",
  "widgets.inputtext.SubmitTextInput1.input_accepted_class": "Class to be set on the input field if set_input_accepted is True.",
  "widgets.inputtext.SubmitTextInput1.input_accepted_class.full": "Class to be set on the input field if set_input_accepted is True. Typically used to show an input has been submitted and accepted ok, such as a green border.",
  "widgets.inputtext.SubmitTextInput1.input_errored_class": "Class to be set on the input field if set_errored_accepted is True.",
  "widgets.inputtext.SubmitTextInput1.input_errored_class.full": "Class to be set on the input field if set_errored_accepted is True. Typically used to show that a submitted value is in error, such as a red border.",
  "widgets.inputtext.SubmitTextInput1.input_tag": "The tag which contains the label and input text.",
  "widgets.inputtext.SubmitTextInput1.input_tag.full": "The tag which contains the label and input text field. Set this to 'span' if you wish the submit button which follows to appear in-line and to the right of the input field.  Or set to div to make the submit button appear on a new line.",
  "widgets.inputtext.SubmitTextInput1.input_text": "The name of the input text field, with default value.",
  "widgets.inputtext.SubmitTextInput1.input_text.full": "The name of the input text field, set the value of this field to the default value shown in the field, the user will change this value which will then be returned. Validators can be added to this field.",
  "widgets.inputtext.SubmitTextInput1.input_text_class": "The class of the text input field",
  "widgets.inputtext.SubmitTextInput1.input_text_class.full": "The class of the text input field",
  "widgets.inputtext.SubmitTextInput1.inputandbutton_class": "The class of the span containing the input text field and submit button",
  "widgets.inputtext.SubmitTextInput1.inputdiv_class": "The class of the div containing label, input text field and submit button.",
  "widgets.inputtext.SubmitTextInput1.label": "The text displayed to the left of the input text field.",
  "widgets.inputtext.SubmitTextInput1.label.full": "The text displayed to the left of the input text field within a 'label' tag. If no text is given no label tag is created. The label tag is given a 'for' attribute with the id of the input text field.",
  "widgets.inputtext.SubmitTextInput1.label_class": "The css class of the label to the left of the input text field.",
  "widgets.inputtext.SubmitTextInput1.label_class.full": "The css class of the label tag to the left of the input text field.",
  "widgets.inputtext.SubmitTextInput1.maxlength": "The maximum number of characters accepted in the text input field.",
  "widgets.inputtext.SubmitTextInput1.maxlength.full": "The maximum number of characters accepted in the text input field.",
  "widgets.inputtext.SubmitTextInput1.required": "Set True to put the 'required' attribute into the input field.",
  "widgets.inputtext.SubmitTextInput1.required.full": "Set True to put the 'required' attribute into the input field.",
  "widgets.inputtext.SubmitTextInput1.size": "The number of characters appearing in the text input field.",
  "widgets.inputtext.SubmitTextInput1.size.full": "The number of characters appearing in the text input field.",
  "widgets.inputtext.TextInput1": "An input field only, no form, label or submit button. For insertion into a form widget container.",
  "widgets.inputtext.TextInput1.disabled": "Set True if the field is to be disabled.",
  "widgets.inputtext.TextInput1.disabled.full": "Set True if the field is to be disabled.",
  "widgets.inputtext.TextInput1.input_accepted_class": "A class which can be added to the input field.",
  "widgets.inputtext.TextInput1.input_accepted_class.full": "A class which will be added to the input field if 'set_input_accepted' is set to True. If widget_class is set, then this class will be added to the class list of the input field, it will not replace widget_class.",
  "widgets.inputtext.TextInput1.input_errored_class": "A class which can be added to the input field.",
  "widgets.inputtext.TextInput1.input_errored_class.full": "A class which will be added to the input field if 'set_input_errored' is set to True. If widget_class is set, then this class will be added to the class list of the input field, it will not replace widget_class.",
  "widgets.inputtext.TextInput1.input_text": "The name of the input text field, with default value.",
  "widgets.inputtext.TextInput1.input_text.full": "The name of the input text field, set the value of this field to the default value shown in the field, the user will change this value which will then be returned. Validators can be added to this field.",
  "widgets.inputtext.TextInput1.maxlength": "The maximum number of characters accepted in the text input field.",
  "widgets.inputtext.TextInput1.maxlength.full": "The maximum number of characters accepted in the text input field.",
  "widgets.inputtext.TextInput1.pattern": "Attribute specifies a regular expression the value is checked against.",
  "widgets.inputtext.TextInput1.required": "Set True to put the 'required' attribute into the input field.",
  "widgets.inputtext.TextInput1.required.full": "Set True to put the 'required' attribute into the input field.",
  "widgets.inputtext.TextInput1.set_input_accepted": "Enable the input_accepted class.",
  "widgets.inputtext.TextInput1.set_input_accepted.full": "If set to True the input_accepted_class will be added to the class list of the input field.",
  "widgets.inputtext.TextInput1.set_input_errored": "Enable the input_errored class.",
  "widgets.inputtext.TextInput1.set_input_errored.full": "If set to True the input_errored_class will be added to the class list of the input field.",
  "widgets.inputtext.TextInput1.size": "The number of characters appearing in the text input field.",
  "widgets.inputtext.TextInput1.size.full": "The number of characters appearing in the text input field.",
  "widgets.inputtext.TextInput1.title": "Shown if the pattern fails.",
  "widgets.inputtext.TextInput2": "Defines a div containing a hidden error paragraph followed by a text input field (no form or submit button). A label to the left of the text can have a class and content set.",
  "widgets.inputtext.TextInput2.disabled": "Set True if the field is to be disabled.",
  "widgets.inputtext.TextInput2.disabled.full": "Set True if the field is to be disabled.",
  "widgets.inputtext.TextInput2.error_class": "The class applied to the hidden paragraph on error.",
  "widgets.inputtext.TextInput2.error_class.full": "The CSS class applied to the hidden paragraph on error.",
  "widgets.inputtext.TextInput2.input_accepted_class": "A class which can be added to the input field.",
  "widgets.inputtext.TextInput2.input_accepted_class.full": "A class which will be added to the input field if 'set_input_accepted' is set to True. If widget_class is set, then this class will be added to the class list of the input field.",
  "widgets.inputtext.TextInput2.input_class": "The css class of the input field.",
  "widgets.inputtext.TextInput2.input_disabled_class": "css class of the input field which replaces input_class if disabled is True.",
  "widgets.inputtext.TextInput2.input_errored_class": "A class which can be added to the input field.",
  "widgets.inputtext.TextInput2.input_errored_class.full": "A class which will be added to the input field if 'set_input_errored' is set to True. If widget_class is set, then this class will be added to the class list of the input field.",
  "widgets.inputtext.TextInput2.input_text": "The name of the input text field, with default value.",
  "widgets.inputtext.TextInput2.input_text.full": "The name of the input text field, set the value of this field to the default value shown in the field, the user will change this value which will then be returned. Validators can be added to this field.",
  "widgets.inputtext.TextInput2.inputdiv_class": "The css class of the div containing the label and input field.",
  "widgets.inputtext.TextInput2.label": "The text displayed to the left of the input text field.",
  "widgets.inputtext.TextInput2.label.full": "The text displayed to the left of the input text field within a 'label' tag. If no text is given no label tag is created. The label tag is given a 'for' attribute with the id of the input text field.",
  "widgets.inputtext.TextInput2.label_class": "A CSS class for the label.",
  "widgets.inputtext.TextInput2.label_class.full": "A CSS class for the label",
  "widgets.inputtext.TextInput2.maxlength": "The maximum number of characters accepted in the text input field.",
  "widgets.inputtext.TextInput2.maxlength.full": "The maximum number of characters accepted in the text input field.",
  "widgets.inputtext.TextInput2.pattern": "Attribute specifies a regular expression the value is checked against.",
  "widgets.inputtext.TextInput2.redstar": "If True a red asterix is shown by the side of the input field.",
  "widgets.inputtext.TextInput2.required": "Set True to put the 'required' attribute into the input field.",
  "widgets.inputtext.TextInput2.required.full": "Set True to put the 'required' attribute into the input field.",
  "widgets.inputtext.TextInput2.set_input_accepted": "Enable the input_accepted class.",
  "widgets.inputtext.TextInput2.set_input_accepted.full": "If set to True the input_accepted_class will be added to the class list of the input field.",
  "widgets.inputtext.TextInput2.set_input_errored": "Enable the input_errored class.",
  "widgets.inputtext.TextInput2.set_input_errored.full": "If set to True the input_errored_class will be added to the class list of the input field.",
  "widgets.inputtext.TextInput2.size": "The number of characters appearing in the text input field.",
  "widgets.inputtext.TextInput2.size.full": "The number of characters appearing in the text input field.",
  "widgets.inputtext.TextInput2.title": "Shown if the pattern fails.",
  "widgets.inputtext.TextInput2.type": "The type set on the input field, such as text or email.",
  "widgets.inputtext.module": "Contains widgets for inputting text.",
  "widgets.links.ButtonLink1": "A button link to the page with the given ident, label or url, and two optional get fields.",
  "widgets.links.ButtonLink1.button_text": "The text to be displayed within the button.",
  "widgets.links.ButtonLink1.button_text.full": "The text to be displayed within the button. If none given, the target page url will be used.",
  "widgets.links.ButtonLink1.error_class": "CSS class which replaces widget_class on error.",
  "widgets.links.ButtonLink1.error_class.full": "The CSS class which replaces widget_class on error. The CSS definition should also include hover and visited states to get a full button effect.",
  "widgets.links.ButtonLink1.force_ident": "If True then the page ident and data will always be included in the request.",
  "widgets.links.ButtonLink1.force_ident.full": "Normally when a widget submits data, the page ident, and ident_data is automatically submitted as well.  However if no 'get' field values are given to this widget, then no data is submitted. Setting this field to True causes page ident and ident_data to always be submitted even if no get field is used.",
  "widgets.links.ButtonLink1.get_field1": "Optional 'get' string set in the target url.",
  "widgets.links.ButtonLink1.get_field1.full": "Optional 'get' string set in the target url.",
  "widgets.links.ButtonLink1.get_field2": "Optional second 'get' string set in the target url.",
  "widgets.links.ButtonLink1.get_field2.full": "Optional second 'get' string set in the target url.",
  "widgets.links.ButtonLink1.hide": "Normally False, if True, and no error, the button will be hidden. JSON settable.",
  "widgets.links.ButtonLink1.hide.full": "Normally False, if True, and no error, the button will be hidden. The widget will still exist on the page, so the widget can be hidden or displayed by a JSON call.",
  "widgets.links.ButtonLink1.link_ident": "The url, ident or label this button links to.",
  "widgets.links.ButtonLink1.link_ident.full": "The url, ident or label this button links to.",
  "widgets.links.ButtonLink1.new_window": "If True the target page opens in a new window.",
  "widgets.links.ButtonLink1.new_window.full": "If True the target page opens in a new window.",
  "widgets.links.ButtonLink1.widget_class": "The CSS class applied to the widget, which should display a button.",
  "widgets.links.ButtonLink1.widget_class.full": "The CSS class applied to the widget, which should display a button. The CSS definition should also include hover and visited states to get a full button effect. If this widget is set to display an error, then this class is replaced by the class defined in field error_class.",
  "widgets.links.ButtonLink2": "A div containing a button link to the page with the given ident, label or url, and two optional get fields.",
  "widgets.links.ButtonLink2.button_text": "The text to be displayed within the button.",
  "widgets.links.ButtonLink2.button_text.full": "The text to be displayed within the button. If none given, the target page url will be used.",
  "widgets.links.ButtonLink2.error_class": "CSS class given to a normally hidden error div.",
  "widgets.links.ButtonLink2.get_field1": "Optional 'get' string set in the target url.",
  "widgets.links.ButtonLink2.get_field2": "Optional second 'get' string set in the target url.",
  "widgets.links.ButtonLink2.hide": "Normally False, if True, and no error, the div and button will be hidden. JSON settable.",
  "widgets.links.ButtonLink2.link_ident": "The url, ident or label this button links to.",
  "widgets.links.ButtonLink2.widget_class": "The CSS class applied to the widget div.",
  "widgets.links.GeneralButtonTable1": "A table of mixed text, textblocks and link buttons with one get field per button.",
  "widgets.links.GeneralButtonTable1.button_class": "The CSS class to apply to the button links",
  "widgets.links.GeneralButtonTable1.cols": "The number of columns in the table.",
  "widgets.links.GeneralButtonTable1.contents": "A list of tuples for every element in the table. This fieldname used as the widgfield for the get data.",
  "widgets.links.GeneralButtonTable1.contents.full": "A list of tuples should be provided. Each inner tuple should have five elements:\r\n\r\n0 Provide a text string or TextBlock reference, used as text of the table cell or the button text.\r\n1 Set True if this is a TextBlock, False if just Text.\r\n2 Set a CSS style on the td tag if required.\r\n3 Link ident or label, if empty, only text will be shown, if given, a link button.\r\n4 The get field value of the link button.\r\n\r\nThis widgfield name will be used as the widgfield of the submitted get field.",
  "widgets.links.GeneralButtonTable1.even_class": "The CSS class of even rows, if empty string, then no class will be applied.",
  "widgets.links.GeneralButtonTable1.force_ident": "If True then the page ident will be included in links, even if no get field is set.",
  "widgets.links.GeneralButtonTable1.hide": "If True, the table will be hidden, can be set by JSON.",
  "widgets.links.GeneralButtonTable1.new_window": "If True, the target='_blank' attribute will be set on each link, to open the target in a new window",
  "widgets.links.GeneralButtonTable1.odd_class": "The CSS class of odd rows, if empty string, then no class will be applied.",
  "widgets.links.GeneralButtonTable1.rows": "The number of rows in the table.",
  "widgets.links.GeneralButtonTable2": "A table of mixed text, and link buttons with one get field per button.",
  "widgets.links.GeneralButtonTable2.button_class": "The CSS class to apply to the button links",
  "widgets.links.GeneralButtonTable2.cols": "A list of two element tuples for every column in the table",
  "widgets.links.GeneralButtonTable2.cols.full": "A list of two element tuples for every column in the table:\r\n0 The target HTML ident or label of buttons in the column, if the second element of this tuple is empty string or the client has javascript disabled.\r\n1 The target JSON ident or label of buttons in the column.",
  "widgets.links.GeneralButtonTable2.contents": "A list of tuples for every element in the table. This fieldname used as the widgfield for the get data.",
  "widgets.links.GeneralButtonTable2.contents.full": "A list of tuples should be provided. Each inner tuple should have four elements:\r\n\r\n0 Provide a text string, either text to display or button text.\r\n1 Set a CSS style on the td tag if required.\r\n2 If False only text will be shown, not a button. If True a link and the button class will be applied.\r\n3 The get field value of the link button.\r\n\r\nThis widgfield name will be used as the widgfield of the submitted get field. The url called is set by the cols field.",
  "widgets.links.GeneralButtonTable2.even_class": "The CSS class of even rows, if empty string, then no class will be applied.",
  "widgets.links.GeneralButtonTable2.hide": "If True, the table will be hidden, can be set by JSON.",
  "widgets.links.GeneralButtonTable2.odd_class": "The CSS class of odd rows, if empty string, then no class will be applied.",
  "widgets.links.GeneralButtonTable2.rows": "The number of rows in the table.",
  "widgets.links.ImageOrTextLink": "Link with displayed contents as either an image page given by img_link or the text given by link_text.",
  "widgets.links.ImageOrTextLink.force_ident": "If True then the page ident and data will always be included in the call.",
  "widgets.links.ImageOrTextLink.force_ident.full": "Normally when a widget submits data, the page ident, and ident_data is automatically submitted as well.  However if no 'get' field values are given to this widget, then no data is submitted. Setting this field to True causes page ident and ident_data to always be submitted even if no get field is used.",
  "widgets.links.ImageOrTextLink.get_field1": "Optional 'get' string set in the target url.",
  "widgets.links.ImageOrTextLink.get_field1.full": "Optional 'get' string set in the target url.",
  "widgets.links.ImageOrTextLink.get_field2": "Optional second 'get' string set in the target url.",
  "widgets.links.ImageOrTextLink.get_field2.full": "Optional second 'get' string set in the target url.",
  "widgets.links.ImageOrTextLink.get_field3": "Optional third 'get' string set in the target url.",
  "widgets.links.ImageOrTextLink.get_field3.full": "Optional third 'get' string set in the target url.",
  "widgets.links.ImageOrTextLink.get_field4": "Optional fourth 'get' string set in the target url.",
  "widgets.links.ImageOrTextLink.get_field4.full": "Optional fourth 'get' string set in the target url.",
  "widgets.links.ImageOrTextLink.height": "Image height.",
  "widgets.links.ImageOrTextLink.height.full": "The height of the image, ignored if text is to be displayed.",
  "widgets.links.ImageOrTextLink.img_link": "The url, ident or label of the image.",
  "widgets.links.ImageOrTextLink.img_link.full": "The url, ident or label of the image.",
  "widgets.links.ImageOrTextLink.link_ident": "The url, ident or label this link targets.",
  "widgets.links.ImageOrTextLink.link_ident.full": "The url, ident or label this link targets.",
  "widgets.links.ImageOrTextLink.link_text": "If given, this text will be used instead of an image.",
  "widgets.links.ImageOrTextLink.link_text.full": "If given, this text will be used instead of an image.",
  "widgets.links.ImageOrTextLink.new_window": "If True, the target will open in a new window.",
  "widgets.links.ImageOrTextLink.new_window.full": "if True, the target='_blank' attribute will be set, to open the target in a new window.",
  "widgets.links.ImageOrTextLink.width": "The image width.",
  "widgets.links.ImageOrTextLink.width.full": "The width of the image, ignored if text is to be displayed.",
  "widgets.links.JSONButtonLink": "A button link with two optional get fields that can be set via JSON.",
  "widgets.links.JSONButtonLink.button_text": "The text to be displayed within the button.",
  "widgets.links.JSONButtonLink.button_text.full": "The text to be displayed within the button. If none given, the target page url will be used.",
  "widgets.links.JSONButtonLink.button_wait_text": "The text to be displayed within the button as the call is made.",
  "widgets.links.JSONButtonLink.error_class": "CSS class which replaces widget_class on error.",
  "widgets.links.JSONButtonLink.error_class.full": "The CSS class which replaces widget_class on error. The CSS definition should also include hover and visited states to get a full button effect.",
  "widgets.links.JSONButtonLink.get_field1": "Optional 'get' string set in the target url, JSON settable.",
  "widgets.links.JSONButtonLink.get_field1.full": "Optional 'get' string set in the target url. Can be set via a JSON call.",
  "widgets.links.JSONButtonLink.get_field2": "Optional second 'get' string set in the target url, JSON settable.",
  "widgets.links.JSONButtonLink.get_field2.full": "Optional second 'get' string set in the target url. Can be set via a JSON call.",
  "widgets.links.JSONButtonLink.hide": "Normally False, if True, and no error, the button will be hidden. JSON settable.",
  "widgets.links.JSONButtonLink.hide.full": "Normally False, if True, and no error, the button will be hidden. The widget will still exist on the page, so the widget can be hidden or displayed by a JSON call.",
  "widgets.links.JSONButtonLink.json_ident": "The url, ident or label this button links to requesting a JSON file returned.",
  "widgets.links.JSONButtonLink.json_ident.full": "The url, ident or label this button links to. Called if the client has Javascript enabled. The link should return a JSON file.",
  "widgets.links.JSONButtonLink.link_ident": "The url, ident or label this button links to if no Javascript.",
  "widgets.links.JSONButtonLink.link_ident.full": "The url, ident or label this button links to. Only called if lson_ident is not set, or if the client has Javascript disabled.",
  "widgets.links.JSONButtonLink.widget_class": "The CSS class applied to the widget.",
  "widgets.links.Link": "A link to the page with the given ident, label or url, and two optional get fields.",
  "widgets.links.Link.content": "The text shown in the link, automatically set to the URL if no text is given.",
  "widgets.links.Link.content.full": "The text shown in the link, automatically set to the URL if no text is given.",
  "widgets.links.Link.force_ident": "If set to True, then ident data will be sent with the link, even if no get field is set.",
  "widgets.links.Link.force_ident.full": "Whenever data is submitted in a get field, a further hidden field is also submitted giving the calling page ident with the ident_data string given by the end_call function.\r\nHowever if no get field has been set with data, this is a link that does not submit data and no ident data is submitted. If you wish to still send ident data in this situation, set the value here to True.",
  "widgets.links.Link.get_field1": "The first get field of the link.",
  "widgets.links.Link.get_field1.full": "This field value is submitted as get data with the link. The field name becomes part of the widgfield submitted.",
  "widgets.links.Link.get_field2": "The second get field of the link.",
  "widgets.links.Link.get_field2.full": "This field value is submitted as get data with the link. The field name becomes part of the widgfield submitted.",
  "widgets.links.Link.link_ident": "The target of the link, being either a page ident, label or URL.",
  "widgets.links.Link.link_ident.full": "The target of the link, can be set with a page ident, label or a URL.",
  "widgets.links.Link.new_window": "If True, the response is opened in a new page.",
  "widgets.links.Link.new_window.full": "If True, the response is opened in a new page.",
  "widgets.links.Table1_Button": "A table of a single text column, followed by a button link column.",
  "widgets.links.Table1_Button.button_class": "The CSS class to apply to the buttons.",
  "widgets.links.Table1_Button.button_text": "Text on the link button.",
  "widgets.links.Table1_Button.contents": "List of lists - [[text, getfield],..]",
  "widgets.links.Table1_Button.even_class": "CSS class of even rows, if empty no class will be applied.",
  "widgets.links.Table1_Button.header_class": "CSS class of the table header row.",
  "widgets.links.Table1_Button.hide": "If True, the table will be hidden.",
  "widgets.links.Table1_Button.json_ident": "The url, ident or label for the buttons, requires a json file to be returned.",
  "widgets.links.Table1_Button.link_ident": "HTML link used if json_ident not given, or if javascript not available.",
  "widgets.links.Table1_Button.maximize_text_col": "If True the text column width is large, and button columns small.",
  "widgets.links.Table1_Button.odd_class": "CSS class of odd rows, if empty no class will be applied.",
  "widgets.links.Table1_Button.title1": "The header title over the text column.",
  "widgets.links.Table1_Buttons4": "A table of a single text column, followed by up to four button link columns",
  "widgets.links.Table1_Buttons4.btn_col1": "True if first button column exists",
  "widgets.links.Table1_Buttons4.btn_col1.full": "True, if first button column exists, False if not. This field name is used as the get field name of the link if get data is to be sent.",
  "widgets.links.Table1_Buttons4.btn_col2": "True if second button column exists",
  "widgets.links.Table1_Buttons4.btn_col2.full": "True, if second button column exists, False if not. This field name is used as the get field name of the link if get data is to be sent.",
  "widgets.links.Table1_Buttons4.btn_col3": "True if third button column exists",
  "widgets.links.Table1_Buttons4.btn_col3.full": "True, if third button column exists, False if not. This field name is used as the get field name of the link if get data is to be sent.",
  "widgets.links.Table1_Buttons4.btn_col4": "True if fourth button column exists",
  "widgets.links.Table1_Buttons4.btn_col4.full": "True, if fourth button column exists, False if not. This field name is used as the get field name of the link if get data is to be sent.",
  "widgets.links.Table1_Buttons4.button_class": "The CSS class to apply to all the buttons",
  "widgets.links.Table1_Buttons4.button_text1": "The text on each of the first column buttons",
  "widgets.links.Table1_Buttons4.button_text2": "The text on each of the second column buttons",
  "widgets.links.Table1_Buttons4.button_text3": "The text on each of the third column buttons",
  "widgets.links.Table1_Buttons4.button_text4": "The text on each of the fourth column buttons",
  "widgets.links.Table1_Buttons4.col0_classes": "List of CSS classes to apply to td elements of the text column",
  "widgets.links.Table1_Buttons4.col0_classes.full": "List of CSS classes to apply to td elements of the text column. The first class in the list will be applied to the first row text td element, the second class to the second row etc., If no list given, no classes will be applied.",
  "widgets.links.Table1_Buttons4.contents": "List of lists, each inner list of nine parameters",
  "widgets.links.Table1_Buttons4.contents.full": "List of lists, each inner list applies to a row and has elements : 0 is the text to place in the first column; 1, 2, 3, 4 are the get field contents of the four button links, empty strings if not used; 5, 6, 7, 8 are boolean True or False, True if the appropriate button is to be shown, False if not.",
  "widgets.links.Table1_Buttons4.even_class": "If given, the CSS class applied to even rows.",
  "widgets.links.Table1_Buttons4.link_ident1": "The target of the first column buttons",
  "widgets.links.Table1_Buttons4.link_ident2": "The target of the second column buttons",
  "widgets.links.Table1_Buttons4.link_ident3": "The target of the third column buttons",
  "widgets.links.Table1_Buttons4.link_ident4": "The target of the fourth column buttons",
  "widgets.links.Table1_Buttons4.maximize_text_col": "If True the text column width is maximised and button columns minimised",
  "widgets.links.Table1_Buttons4.odd_class": "If given, the CSS class applied to odd rows.",
  "widgets.links.module": "Links, including links to page idents, and tables of links with get fields and link text.",
  "widgets.logins.module": "Widgets displaying login forms.",
  "widgets.paras.DivPara": "A div containing a paragraph, containing text, if an error is raised, then the text is changed for the error message and the error_class given to the paragraph.",
  "widgets.paras.JSONDivLink": "A div with button and inner div of content. If inner div is visible, it is hidden on link press. If hidden, a call is made.",
  "widgets.paras.JSONDivLink.button_class": "CSS class of the button link.",
  "widgets.paras.JSONDivLink.button_class.full": "CSS class of the button link.",
  "widgets.paras.JSONDivLink.button_hide_text": "Button text when content is visible.",
  "widgets.paras.JSONDivLink.button_hide_text.full": "Button text when content is visible, automatically set on the button by javascript when button pressed to display contents.",
  "widgets.paras.JSONDivLink.button_show_text": "Button text when content is hidden.",
  "widgets.paras.JSONDivLink.button_show_text.": "Button text when content is hidden.",
  "widgets.paras.JSONDivLink.button_show_text.full": "Button text when content is hidden, automatically set on the button by javascript when button pressed to hide contents.",
  "widgets.paras.JSONDivLink.div_class": "CSS class of the content div.",
  "widgets.paras.JSONDivLink.div_class.full": "CSS class of the content div.",
  "widgets.paras.JSONDivLink.div_content": "Text or html string to place in the content div.",
  "widgets.paras.JSONDivLink.div_content.full": "Text or html string to place in the content div. When a call is made to display the contents, this is normally returned (with hide set to False) by JSON to display the text or html.",
  "widgets.paras.JSONDivLink.get_field": "GET data to send when button is pressed.",
  "widgets.paras.JSONDivLink.get_field.full": "GET data to send when button is pressed.",
  "widgets.paras.JSONDivLink.hide": "Set True to hide the contents div, False to show it.",
  "widgets.paras.JSONDivLink.hide.full": "Normally initially set to True on a page to hide the contents div. When a call is made (button pressed to show contents) return hide set to False, and div_content with the text to display. When the button is pressed to toggle to hide again, no call is made as the text is hidden by javascript.",
  "widgets.paras.JSONDivLink.htmlescaped": "If True, any html in the content is escaped.",
  "widgets.paras.JSONDivLink.htmlescaped.full": "If True, any html in the content is escaped.",
  "widgets.paras.JSONDivLink.json_ident": "label or ident of JSON page called to display content.",
  "widgets.paras.JSONDivLink.json_ident.full": "label or ident of JSON page called to display content. Normally a responder which sets hide to False, and div_content to the required text, and passes this to general_json to be returned and displayed.",
  "widgets.paras.JSONDivLink.link_ident": "ident or label of page warning that javascript is needed.",
  "widgets.paras.JSONDivLink.link_ident.full": "As this widget requires javascript, this ident or label should be to a page warning that javascript is needed. Will be called on button press if client browser does not have javascript enabled.",
  "widgets.paras.JSONTextLink": "A div containing an anchor link (used as a button) followed by a paragraph which is hidden when button pressed, or if already hidden, a JSON call is made which can set and display the paragraph.",
  "widgets.paras.JSONTextLink.button_class": "The CSS class set on the anchor tag. Used to describe the button to be pressed.",
  "widgets.paras.JSONTextLink.button_class.full": "The CSS class to be set on the 'a' tag, generally used to describe how the button will look.",
  "widgets.paras.JSONTextLink.hide": "If True, hides the paragraph (Note: Not the button). If False, shows it, JSON Enabled.",
  "widgets.paras.JSONTextLink.hide.full": "Normally set to True here, which hides the paragraph (The button link will still be shown). If set to False, displays the paragraph.\r\nGenerally used when the button sends a JSON call, you should return the new text (if any) and also return this hide field with a False value to display the paragraph.",
  "widgets.paras.ParaText": "A p tag, containing text. The text can be set by JSON.",
  "widgets.paras.ParaText.para_text": "The text of the paragraph. Can be set by JSON.",
  "widgets.paras.ShowPara1": "A div, containing a paragraph of text followed by an error paragraph.\r\nThe text paragraph is normally visible (depending on the show_para field),\r\nthe error paragraph is hidden, and becomes visible on error.",
  "widgets.paras.ShowPara1.error_class": "The class of the error text - which provides the appearance via CSS",
  "widgets.paras.ShowPara1.para_class": "The class of the paragraph - which provides the appearance via CSS",
  "widgets.paras.ShowPara1.para_text": "Set this with the text to appear in the paragraph.  This can also be set via a JSON file.",
  "widgets.paras.ShowPara1.show_error": "The default error text to be displayed. If this is set into the page_data dictionary it will cause the error paragraph to be displayed. Can be set by JSON file.",
  "widgets.paras.ShowPara1.show_para": "Set to True to display the paragraph, or False to hide it.  This can also be set via a JSON file.",
  "widgets.paras.SpanText": "A span tag, containing text. The text can be set by JSON.",
  "widgets.paras.TextBlockPara": "A paragraph, containing a TextBlock, if an error is raised, then the text is changed\nfor the error_message and the error_class given to the paragraph.",
  "widgets.paras.TextBlockParaHider": "A paragraph, containing a TextBlock, if an error is raised, then the text is changed\nfor the error_message and the error_class given to the paragraph. If the user clicks\nthe text, it hides.",
  "widgets.paras.TextBlockParaHider.replace_strings": "A list of strings, which if given, will be used with the python % operator on the text, replacing any '%s' characters set in the TextBlock.",
  "widgets.paras.module": "Paragraphs, including paragraphs showing TextBlocks and error messages.",
  "widgets.radio.BooleanRadio": "A two option radio control for choosing True or False. Without a form or submit button, typically included within a form.",
  "widgets.radio.BooleanRadio.div_class1": "Class of the first div containing the first radio button",
  "widgets.radio.BooleanRadio.div_class1.full": "Class of the first div containing the first radio button",
  "widgets.radio.BooleanRadio.div_class2": "Class of the second div containing the second radio button",
  "widgets.radio.BooleanRadio.div_class2.full": "Class of the second div containing the second radio button",
  "widgets.radio.BooleanRadio.left_class1": "The css class of the label to the left of the first radio button",
  "widgets.radio.BooleanRadio.left_class1.full": "The css class of the label to the left of the first radio button",
  "widgets.radio.BooleanRadio.left_class2": "The css class of the label to the left of the second radio button",
  "widgets.radio.BooleanRadio.left_class2.full": "The css class of the label to the left of the second radio button",
  "widgets.radio.BooleanRadio.left_label1": "The text displayed to the left of the first radio button",
  "widgets.radio.BooleanRadio.left_label1.full": "The text displayed to the left of the first radio button",
  "widgets.radio.BooleanRadio.left_label2": "The text displayed to the left of the second radio button",
  "widgets.radio.BooleanRadio.left_label2.full": "The text displayed to the left of the second radio button",
  "widgets.radio.BooleanRadio.radio_checked": "default value to be checked, True or False, field name is the field returned",
  "widgets.radio.BooleanRadio.radio_checked.full": "default value to be checked, True or False, field name is the field returned",
  "widgets.radio.BooleanRadio.right_class1": "The css class of the label to the right of the first radio button",
  "widgets.radio.BooleanRadio.right_class1.full": "The css class of the label to the right of the first radio button",
  "widgets.radio.BooleanRadio.right_class2": "The css class of the label to the right of the second radio button",
  "widgets.radio.BooleanRadio.right_class2.full": "The css class of the label to the right of the second radio button",
  "widgets.radio.BooleanRadio.right_label1": "The text displayed to the right of the first radio button",
  "widgets.radio.BooleanRadio.right_label1.full": "The text displayed to the right of the first radio button",
  "widgets.radio.BooleanRadio.right_label2": "The text displayed to the right of the second radio button",
  "widgets.radio.BooleanRadio.right_label2.full": "The text displayed to the right of the second radio button",
  "widgets.radio.RadioButton1": "A set of radiobuttons - but without a form or submit button, typically included within a form.",
  "widgets.radio.RadioButton1.radio_checked": "The value to appear checked, can be set via JSON.",
  "widgets.radio.RadioButton1.radio_checked.full": "The value which has its associated button checked, and is the value returned when the enclosing form is submitted, unless the user chooses another button. The returned widgfield will consist of this (widget name, field name).\r\n\r\nThis field and value can also be sent via a json file, in which case the checked radio button on the form will be seen to change to this value. ",
  "widgets.radio.RadioButton1.radio_text": "A list of text strings, these will be the labels appearing to the right of the radio buttons.",
  "widgets.radio.RadioButton1.radio_values": "A list of values assigned to each radio button, one will be returned if its button is checked.",
  "widgets.radio.module": "Radio buttons.",
  "widgets.show": "If True, the widget is included in the page. If False the widget is removed.",
  "widgets.show.full": "Takes value True or False. If True, the widget is included in the page. If False the widget is removed.  This is not the equivalent of the \"hide\" attribute, as the widget is not present in the html data transmitted, and therefore cannot be displayed via a CSS or javascript command.",
  "widgets.show_error": "Sets the widget default error message.",
  "widgets.svgarrows.module": "Square SVG images containing arrows",
  "widgets.svgbasics.module": "SVG rectangles and text shapes.",
  "widgets.tables.ButtonTextBlockTable1": "A form consisting of a table of form buttons and TextBlocks.",
  "widgets.tables.ColorTable1": "A table of coloured text strings.",
  "widgets.tables.ColorTable1.contents": "A list of lists, each inner list is [text, text colour, background color].",
  "widgets.tables.ColorTable1.contents.full": "A list of lists, each inner list is [text, text colour, background color]. These colour strings being CSS colours which will be applied to the cell style. The number of these inner lists define the total number of cells in the table.",
  "widgets.tables.ColorTable1.even_class": "The CSS class applied to even rows.",
  "widgets.tables.ColorTable1.even_class.full": "The CSS class applied to even rows, if empty string, then no class will be applied.",
  "widgets.tables.ColorTable1.header_class": "The CSS class of the header row.",
  "widgets.tables.ColorTable1.header_class.full": "The CSS class of the header row, if empty string, then no class will be applied.",
  "widgets.tables.ColorTable1.odd_class": "The CSS class applied to odd rows",
  "widgets.tables.ColorTable1.odd_class.full": "The CSS class set on odd rows, if empty string, then no class will be applied.",
  "widgets.tables.ColorTable1.titles": "List of text strings used as header titles.",
  "widgets.tables.ColorTable1.titles.full": "List of text strings used as header titles. The length of this list determines the number of columns in the table.",
  "widgets.tables.TextBlockTable2": "A table of two columns: [text strings, TextBlocks].",
  "widgets.tables.TextBlockTable2.contents": "List of two item lists, [['text', 'textblock_ref'], ... ].",
  "widgets.tables.TextBlockTable2.contents.full": "List of two item lists, [['text', 'textblock_ref'], ... ], Being text to place in the first column, and reference of the TextBlock to place in the second column. The number of inner lists being the number of rows in the table.",
  "widgets.tables.TextBlockTable2.even_class": "CSS class of even rows.",
  "widgets.tables.TextBlockTable2.even_class.full": "CSS class of even rows, if empty string, then no class will be applied.",
  "widgets.tables.TextBlockTable2.header_class": "CSS class of the header row.",
  "widgets.tables.TextBlockTable2.header_class.full": "CSS class of the header row, if empty string, then no class will be applied.",
  "widgets.tables.TextBlockTable2.odd_class": "CSS class of odd rows.",
  "widgets.tables.TextBlockTable2.odd_class.full": "CSS class of odd rows, if empty string, then no class will be applied.",
  "widgets.tables.TextBlockTable2.title1": "The header title over the first text column.",
  "widgets.tables.TextBlockTable2.title1.full": "The header title over the first text column.",
  "widgets.tables.TextBlockTable2.title2": "The header title over the second text column.",
  "widgets.tables.TextBlockTable2.title2.full": "The header title over the second text column.",
  "widgets.tables.TwoColTable1": "A table of two text columns, JSON settable.",
  "widgets.tables.TwoColTable1.col1": "A list of text strings to place in the first column.",
  "widgets.tables.TwoColTable1.col1.full": "A list of text strings to place in the first column.",
  "widgets.tables.TwoColTable1.col2": "A list of text strings to place in the second column.",
  "widgets.tables.TwoColTable1.col2.full": "A list of text strings to place in the second column.",
  "widgets.tables.TwoColTable1.even_class": "CSS class of even rows.",
  "widgets.tables.TwoColTable1.even_class.full": "CSS class of even rows, if empty string, then no class will be applied.",
  "widgets.tables.TwoColTable1.header_class": "CSS class of the header row.",
  "widgets.tables.TwoColTable1.header_class.full": "CSS class of the header row, if empty string, then no class will be applied.",
  "widgets.tables.TwoColTable1.odd_class": "CSS class of odd rows.",
  "widgets.tables.TwoColTable1.odd_class.full": "CSS class of odd rows, if empty string, then no class will be applied.",
  "widgets.tables.TwoColTable1.title1": "The header title over the first text column.",
  "widgets.tables.TwoColTable1.title1.full": "The header title over the first text column.",
  "widgets.tables.TwoColTable1.title2": "The header title over the second text column.",
  "widgets.tables.TwoColTable1.title2.full": "The header title over the second text column.",
  "widgets.tables.module": "Text tables.",
  "widgets.textarea.module": "Widgets containing a textarea to insert into a form.",
  "widgets.upload.module": "Widgets containing an upload input button to insert into a form.",
  "widgets.widget_class": "The class attribute set in the widget.",
  "widgets.widget_class.full": "The class attribute (if any) set in the widget first tag. This allows the look of the widget to be defined via CSS. If the value is left empty then no class attribute is used.",
  "widgets.widget_style": "If given, sets the 'style' attribute of the widget."
}